GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F47Q10_INC_
#define _PIC18F47Q10_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F47Q10
 */

/*
 * Device Registers
 */

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 0E1Fh
// bitfield definitions
CLCIN0PPS_PIN_POSN                       equ 0000h
CLCIN0PPS_PIN_POSITION                   equ 0000h
CLCIN0PPS_PIN_SIZE                       equ 0003h
CLCIN0PPS_PIN_LENGTH                     equ 0003h
CLCIN0PPS_PIN_MASK                       equ 0007h
CLCIN0PPS_PORT_POSN                      equ 0003h
CLCIN0PPS_PORT_POSITION                  equ 0003h
CLCIN0PPS_PORT_SIZE                      equ 0002h
CLCIN0PPS_PORT_LENGTH                    equ 0002h
CLCIN0PPS_PORT_MASK                      equ 0018h
CLCIN0PPS_CLCIN0PPS0_POSN                equ 0000h
CLCIN0PPS_CLCIN0PPS0_POSITION            equ 0000h
CLCIN0PPS_CLCIN0PPS0_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS0_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS0_MASK                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSN                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSITION            equ 0001h
CLCIN0PPS_CLCIN0PPS1_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS1_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS1_MASK                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSN                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSITION            equ 0002h
CLCIN0PPS_CLCIN0PPS2_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS2_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS2_MASK                equ 0004h
CLCIN0PPS_CLCIN0PPS3_POSN                equ 0003h
CLCIN0PPS_CLCIN0PPS3_POSITION            equ 0003h
CLCIN0PPS_CLCIN0PPS3_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS3_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS3_MASK                equ 0008h
CLCIN0PPS_CLCIN0PPS4_POSN                equ 0004h
CLCIN0PPS_CLCIN0PPS4_POSITION            equ 0004h
CLCIN0PPS_CLCIN0PPS4_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS4_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS4_MASK                equ 0010h
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0005h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0005h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 001Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 0E20h
// bitfield definitions
CLCIN1PPS_PIN_POSN                       equ 0000h
CLCIN1PPS_PIN_POSITION                   equ 0000h
CLCIN1PPS_PIN_SIZE                       equ 0003h
CLCIN1PPS_PIN_LENGTH                     equ 0003h
CLCIN1PPS_PIN_MASK                       equ 0007h
CLCIN1PPS_PORT_POSN                      equ 0003h
CLCIN1PPS_PORT_POSITION                  equ 0003h
CLCIN1PPS_PORT_SIZE                      equ 0002h
CLCIN1PPS_PORT_LENGTH                    equ 0002h
CLCIN1PPS_PORT_MASK                      equ 0018h
CLCIN1PPS_CLCIN1PPS0_POSN                equ 0000h
CLCIN1PPS_CLCIN1PPS0_POSITION            equ 0000h
CLCIN1PPS_CLCIN1PPS0_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS0_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS0_MASK                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSN                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSITION            equ 0001h
CLCIN1PPS_CLCIN1PPS1_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS1_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS1_MASK                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSN                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSITION            equ 0002h
CLCIN1PPS_CLCIN1PPS2_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS2_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS2_MASK                equ 0004h
CLCIN1PPS_CLCIN1PPS3_POSN                equ 0003h
CLCIN1PPS_CLCIN1PPS3_POSITION            equ 0003h
CLCIN1PPS_CLCIN1PPS3_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS3_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS3_MASK                equ 0008h
CLCIN1PPS_CLCIN1PPS4_POSN                equ 0004h
CLCIN1PPS_CLCIN1PPS4_POSITION            equ 0004h
CLCIN1PPS_CLCIN1PPS4_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS4_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS4_MASK                equ 0010h
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0005h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0005h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 001Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 0E21h
// bitfield definitions
CLCIN2PPS_PIN_POSN                       equ 0000h
CLCIN2PPS_PIN_POSITION                   equ 0000h
CLCIN2PPS_PIN_SIZE                       equ 0003h
CLCIN2PPS_PIN_LENGTH                     equ 0003h
CLCIN2PPS_PIN_MASK                       equ 0007h
CLCIN2PPS_PORT_POSN                      equ 0003h
CLCIN2PPS_PORT_POSITION                  equ 0003h
CLCIN2PPS_PORT_SIZE                      equ 0002h
CLCIN2PPS_PORT_LENGTH                    equ 0002h
CLCIN2PPS_PORT_MASK                      equ 0018h
CLCIN2PPS_CLCIN2PPS0_POSN                equ 0000h
CLCIN2PPS_CLCIN2PPS0_POSITION            equ 0000h
CLCIN2PPS_CLCIN2PPS0_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS0_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS0_MASK                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSN                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSITION            equ 0001h
CLCIN2PPS_CLCIN2PPS1_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS1_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS1_MASK                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSN                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSITION            equ 0002h
CLCIN2PPS_CLCIN2PPS2_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS2_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS2_MASK                equ 0004h
CLCIN2PPS_CLCIN2PPS3_POSN                equ 0003h
CLCIN2PPS_CLCIN2PPS3_POSITION            equ 0003h
CLCIN2PPS_CLCIN2PPS3_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS3_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS3_MASK                equ 0008h
CLCIN2PPS_CLCIN2PPS4_POSN                equ 0004h
CLCIN2PPS_CLCIN2PPS4_POSITION            equ 0004h
CLCIN2PPS_CLCIN2PPS4_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS4_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS4_MASK                equ 0010h
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0005h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0005h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 001Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 0E22h
// bitfield definitions
CLCIN3PPS_PIN_POSN                       equ 0000h
CLCIN3PPS_PIN_POSITION                   equ 0000h
CLCIN3PPS_PIN_SIZE                       equ 0003h
CLCIN3PPS_PIN_LENGTH                     equ 0003h
CLCIN3PPS_PIN_MASK                       equ 0007h
CLCIN3PPS_PORT_POSN                      equ 0003h
CLCIN3PPS_PORT_POSITION                  equ 0003h
CLCIN3PPS_PORT_SIZE                      equ 0002h
CLCIN3PPS_PORT_LENGTH                    equ 0002h
CLCIN3PPS_PORT_MASK                      equ 0018h
CLCIN3PPS_CLCIN3PPS0_POSN                equ 0000h
CLCIN3PPS_CLCIN3PPS0_POSITION            equ 0000h
CLCIN3PPS_CLCIN3PPS0_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS0_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS0_MASK                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSN                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSITION            equ 0001h
CLCIN3PPS_CLCIN3PPS1_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS1_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS1_MASK                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSN                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSITION            equ 0002h
CLCIN3PPS_CLCIN3PPS2_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS2_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS2_MASK                equ 0004h
CLCIN3PPS_CLCIN3PPS3_POSN                equ 0003h
CLCIN3PPS_CLCIN3PPS3_POSITION            equ 0003h
CLCIN3PPS_CLCIN3PPS3_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS3_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS3_MASK                equ 0008h
CLCIN3PPS_CLCIN3PPS4_POSN                equ 0004h
CLCIN3PPS_CLCIN3PPS4_POSITION            equ 0004h
CLCIN3PPS_CLCIN3PPS4_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS4_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS4_MASK                equ 0010h
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0005h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0005h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 001Fh

// Register: CLCIN4PPS
#define CLCIN4PPS CLCIN4PPS
CLCIN4PPS                                equ 0E23h
// bitfield definitions
CLCIN4PPS_PIN_POSN                       equ 0000h
CLCIN4PPS_PIN_POSITION                   equ 0000h
CLCIN4PPS_PIN_SIZE                       equ 0003h
CLCIN4PPS_PIN_LENGTH                     equ 0003h
CLCIN4PPS_PIN_MASK                       equ 0007h
CLCIN4PPS_PORT_POSN                      equ 0003h
CLCIN4PPS_PORT_POSITION                  equ 0003h
CLCIN4PPS_PORT_SIZE                      equ 0002h
CLCIN4PPS_PORT_LENGTH                    equ 0002h
CLCIN4PPS_PORT_MASK                      equ 0018h
CLCIN4PPS_CLCIN4PPS0_POSN                equ 0000h
CLCIN4PPS_CLCIN4PPS0_POSITION            equ 0000h
CLCIN4PPS_CLCIN4PPS0_SIZE                equ 0001h
CLCIN4PPS_CLCIN4PPS0_LENGTH              equ 0001h
CLCIN4PPS_CLCIN4PPS0_MASK                equ 0001h
CLCIN4PPS_CLCIN4PPS1_POSN                equ 0001h
CLCIN4PPS_CLCIN4PPS1_POSITION            equ 0001h
CLCIN4PPS_CLCIN4PPS1_SIZE                equ 0001h
CLCIN4PPS_CLCIN4PPS1_LENGTH              equ 0001h
CLCIN4PPS_CLCIN4PPS1_MASK                equ 0002h
CLCIN4PPS_CLCIN4PPS2_POSN                equ 0002h
CLCIN4PPS_CLCIN4PPS2_POSITION            equ 0002h
CLCIN4PPS_CLCIN4PPS2_SIZE                equ 0001h
CLCIN4PPS_CLCIN4PPS2_LENGTH              equ 0001h
CLCIN4PPS_CLCIN4PPS2_MASK                equ 0004h
CLCIN4PPS_CLCIN4PPS3_POSN                equ 0003h
CLCIN4PPS_CLCIN4PPS3_POSITION            equ 0003h
CLCIN4PPS_CLCIN4PPS3_SIZE                equ 0001h
CLCIN4PPS_CLCIN4PPS3_LENGTH              equ 0001h
CLCIN4PPS_CLCIN4PPS3_MASK                equ 0008h
CLCIN4PPS_CLCIN4PPS4_POSN                equ 0004h
CLCIN4PPS_CLCIN4PPS4_POSITION            equ 0004h
CLCIN4PPS_CLCIN4PPS4_SIZE                equ 0001h
CLCIN4PPS_CLCIN4PPS4_LENGTH              equ 0001h
CLCIN4PPS_CLCIN4PPS4_MASK                equ 0010h
CLCIN4PPS_CLCIN4PPS_POSN                 equ 0000h
CLCIN4PPS_CLCIN4PPS_POSITION             equ 0000h
CLCIN4PPS_CLCIN4PPS_SIZE                 equ 0005h
CLCIN4PPS_CLCIN4PPS_LENGTH               equ 0005h
CLCIN4PPS_CLCIN4PPS_MASK                 equ 001Fh

// Register: CLCIN5PPS
#define CLCIN5PPS CLCIN5PPS
CLCIN5PPS                                equ 0E24h
// bitfield definitions
CLCIN5PPS_PIN_POSN                       equ 0000h
CLCIN5PPS_PIN_POSITION                   equ 0000h
CLCIN5PPS_PIN_SIZE                       equ 0003h
CLCIN5PPS_PIN_LENGTH                     equ 0003h
CLCIN5PPS_PIN_MASK                       equ 0007h
CLCIN5PPS_PORT_POSN                      equ 0003h
CLCIN5PPS_PORT_POSITION                  equ 0003h
CLCIN5PPS_PORT_SIZE                      equ 0002h
CLCIN5PPS_PORT_LENGTH                    equ 0002h
CLCIN5PPS_PORT_MASK                      equ 0018h
CLCIN5PPS_CLCIN5PPS0_POSN                equ 0000h
CLCIN5PPS_CLCIN5PPS0_POSITION            equ 0000h
CLCIN5PPS_CLCIN5PPS0_SIZE                equ 0001h
CLCIN5PPS_CLCIN5PPS0_LENGTH              equ 0001h
CLCIN5PPS_CLCIN5PPS0_MASK                equ 0001h
CLCIN5PPS_CLCIN5PPS1_POSN                equ 0001h
CLCIN5PPS_CLCIN5PPS1_POSITION            equ 0001h
CLCIN5PPS_CLCIN5PPS1_SIZE                equ 0001h
CLCIN5PPS_CLCIN5PPS1_LENGTH              equ 0001h
CLCIN5PPS_CLCIN5PPS1_MASK                equ 0002h
CLCIN5PPS_CLCIN5PPS2_POSN                equ 0002h
CLCIN5PPS_CLCIN5PPS2_POSITION            equ 0002h
CLCIN5PPS_CLCIN5PPS2_SIZE                equ 0001h
CLCIN5PPS_CLCIN5PPS2_LENGTH              equ 0001h
CLCIN5PPS_CLCIN5PPS2_MASK                equ 0004h
CLCIN5PPS_CLCIN5PPS3_POSN                equ 0003h
CLCIN5PPS_CLCIN5PPS3_POSITION            equ 0003h
CLCIN5PPS_CLCIN5PPS3_SIZE                equ 0001h
CLCIN5PPS_CLCIN5PPS3_LENGTH              equ 0001h
CLCIN5PPS_CLCIN5PPS3_MASK                equ 0008h
CLCIN5PPS_CLCIN5PPS4_POSN                equ 0004h
CLCIN5PPS_CLCIN5PPS4_POSITION            equ 0004h
CLCIN5PPS_CLCIN5PPS4_SIZE                equ 0001h
CLCIN5PPS_CLCIN5PPS4_LENGTH              equ 0001h
CLCIN5PPS_CLCIN5PPS4_MASK                equ 0010h
CLCIN5PPS_CLCIN5PPS_POSN                 equ 0000h
CLCIN5PPS_CLCIN5PPS_POSITION             equ 0000h
CLCIN5PPS_CLCIN5PPS_SIZE                 equ 0005h
CLCIN5PPS_CLCIN5PPS_LENGTH               equ 0005h
CLCIN5PPS_CLCIN5PPS_MASK                 equ 001Fh

