GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
// Register: CLC3GLS0
#define CLC3GLS0 CLC3GLS0
CLC3GLS0                                 equ 0E41h
// bitfield definitions
CLC3GLS0_G1D1N_POSN                      equ 0000h
CLC3GLS0_G1D1N_POSITION                  equ 0000h
CLC3GLS0_G1D1N_SIZE                      equ 0001h
CLC3GLS0_G1D1N_LENGTH                    equ 0001h
CLC3GLS0_G1D1N_MASK                      equ 0001h
CLC3GLS0_G1D1T_POSN                      equ 0001h
CLC3GLS0_G1D1T_POSITION                  equ 0001h
CLC3GLS0_G1D1T_SIZE                      equ 0001h
CLC3GLS0_G1D1T_LENGTH                    equ 0001h
CLC3GLS0_G1D1T_MASK                      equ 0002h
CLC3GLS0_G1D2N_POSN                      equ 0002h
CLC3GLS0_G1D2N_POSITION                  equ 0002h
CLC3GLS0_G1D2N_SIZE                      equ 0001h
CLC3GLS0_G1D2N_LENGTH                    equ 0001h
CLC3GLS0_G1D2N_MASK                      equ 0004h
CLC3GLS0_G1D2T_POSN                      equ 0003h
CLC3GLS0_G1D2T_POSITION                  equ 0003h
CLC3GLS0_G1D2T_SIZE                      equ 0001h
CLC3GLS0_G1D2T_LENGTH                    equ 0001h
CLC3GLS0_G1D2T_MASK                      equ 0008h
CLC3GLS0_G1D3N_POSN                      equ 0004h
CLC3GLS0_G1D3N_POSITION                  equ 0004h
CLC3GLS0_G1D3N_SIZE                      equ 0001h
CLC3GLS0_G1D3N_LENGTH                    equ 0001h
CLC3GLS0_G1D3N_MASK                      equ 0010h
CLC3GLS0_G1D3T_POSN                      equ 0005h
CLC3GLS0_G1D3T_POSITION                  equ 0005h
CLC3GLS0_G1D3T_SIZE                      equ 0001h
CLC3GLS0_G1D3T_LENGTH                    equ 0001h
CLC3GLS0_G1D3T_MASK                      equ 0020h
CLC3GLS0_G1D4N_POSN                      equ 0006h
CLC3GLS0_G1D4N_POSITION                  equ 0006h
CLC3GLS0_G1D4N_SIZE                      equ 0001h
CLC3GLS0_G1D4N_LENGTH                    equ 0001h
CLC3GLS0_G1D4N_MASK                      equ 0040h
CLC3GLS0_G1D4T_POSN                      equ 0007h
CLC3GLS0_G1D4T_POSITION                  equ 0007h
CLC3GLS0_G1D4T_SIZE                      equ 0001h
CLC3GLS0_G1D4T_LENGTH                    equ 0001h
CLC3GLS0_G1D4T_MASK                      equ 0080h
CLC3GLS0_LC3G1D1N_POSN                   equ 0000h
CLC3GLS0_LC3G1D1N_POSITION               equ 0000h
CLC3GLS0_LC3G1D1N_SIZE                   equ 0001h
CLC3GLS0_LC3G1D1N_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D1N_MASK                   equ 0001h
CLC3GLS0_LC3G1D1T_POSN                   equ 0001h
CLC3GLS0_LC3G1D1T_POSITION               equ 0001h
CLC3GLS0_LC3G1D1T_SIZE                   equ 0001h
CLC3GLS0_LC3G1D1T_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D1T_MASK                   equ 0002h
CLC3GLS0_LC3G1D2N_POSN                   equ 0002h
CLC3GLS0_LC3G1D2N_POSITION               equ 0002h
CLC3GLS0_LC3G1D2N_SIZE                   equ 0001h
CLC3GLS0_LC3G1D2N_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D2N_MASK                   equ 0004h
CLC3GLS0_LC3G1D2T_POSN                   equ 0003h
CLC3GLS0_LC3G1D2T_POSITION               equ 0003h
CLC3GLS0_LC3G1D2T_SIZE                   equ 0001h
CLC3GLS0_LC3G1D2T_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D2T_MASK                   equ 0008h
CLC3GLS0_LC3G1D3N_POSN                   equ 0004h
CLC3GLS0_LC3G1D3N_POSITION               equ 0004h
CLC3GLS0_LC3G1D3N_SIZE                   equ 0001h
CLC3GLS0_LC3G1D3N_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D3N_MASK                   equ 0010h
CLC3GLS0_LC3G1D3T_POSN                   equ 0005h
CLC3GLS0_LC3G1D3T_POSITION               equ 0005h
CLC3GLS0_LC3G1D3T_SIZE                   equ 0001h
CLC3GLS0_LC3G1D3T_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D3T_MASK                   equ 0020h
CLC3GLS0_LC3G1D4N_POSN                   equ 0006h
CLC3GLS0_LC3G1D4N_POSITION               equ 0006h
CLC3GLS0_LC3G1D4N_SIZE                   equ 0001h
CLC3GLS0_LC3G1D4N_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D4N_MASK                   equ 0040h
CLC3GLS0_LC3G1D4T_POSN                   equ 0007h
CLC3GLS0_LC3G1D4T_POSITION               equ 0007h
CLC3GLS0_LC3G1D4T_SIZE                   equ 0001h
CLC3GLS0_LC3G1D4T_LENGTH                 equ 0001h
CLC3GLS0_LC3G1D4T_MASK                   equ 0080h

// Register: CLC3GLS1
#define CLC3GLS1 CLC3GLS1
CLC3GLS1                                 equ 0E42h
// bitfield definitions
CLC3GLS1_G2D1N_POSN                      equ 0000h
CLC3GLS1_G2D1N_POSITION                  equ 0000h
CLC3GLS1_G2D1N_SIZE                      equ 0001h
CLC3GLS1_G2D1N_LENGTH                    equ 0001h
CLC3GLS1_G2D1N_MASK                      equ 0001h
CLC3GLS1_G2D1T_POSN                      equ 0001h
CLC3GLS1_G2D1T_POSITION                  equ 0001h
CLC3GLS1_G2D1T_SIZE                      equ 0001h
CLC3GLS1_G2D1T_LENGTH                    equ 0001h
CLC3GLS1_G2D1T_MASK                      equ 0002h
CLC3GLS1_G2D2N_POSN                      equ 0002h
CLC3GLS1_G2D2N_POSITION                  equ 0002h
CLC3GLS1_G2D2N_SIZE                      equ 0001h
CLC3GLS1_G2D2N_LENGTH                    equ 0001h
CLC3GLS1_G2D2N_MASK                      equ 0004h
CLC3GLS1_G2D2T_POSN                      equ 0003h
CLC3GLS1_G2D2T_POSITION                  equ 0003h
CLC3GLS1_G2D2T_SIZE                      equ 0001h
CLC3GLS1_G2D2T_LENGTH                    equ 0001h
CLC3GLS1_G2D2T_MASK                      equ 0008h
CLC3GLS1_G2D3N_POSN                      equ 0004h
CLC3GLS1_G2D3N_POSITION                  equ 0004h
CLC3GLS1_G2D3N_SIZE                      equ 0001h
CLC3GLS1_G2D3N_LENGTH                    equ 0001h
CLC3GLS1_G2D3N_MASK                      equ 0010h
CLC3GLS1_G2D3T_POSN                      equ 0005h
CLC3GLS1_G2D3T_POSITION                  equ 0005h
CLC3GLS1_G2D3T_SIZE                      equ 0001h
CLC3GLS1_G2D3T_LENGTH                    equ 0001h
CLC3GLS1_G2D3T_MASK                      equ 0020h
CLC3GLS1_G2D4N_POSN                      equ 0006h
CLC3GLS1_G2D4N_POSITION                  equ 0006h
CLC3GLS1_G2D4N_SIZE                      equ 0001h
CLC3GLS1_G2D4N_LENGTH                    equ 0001h
CLC3GLS1_G2D4N_MASK                      equ 0040h
CLC3GLS1_G2D4T_POSN                      equ 0007h
CLC3GLS1_G2D4T_POSITION                  equ 0007h
CLC3GLS1_G2D4T_SIZE                      equ 0001h
CLC3GLS1_G2D4T_LENGTH                    equ 0001h
CLC3GLS1_G2D4T_MASK                      equ 0080h
CLC3GLS1_LC3G2D1N_POSN                   equ 0000h
CLC3GLS1_LC3G2D1N_POSITION               equ 0000h
CLC3GLS1_LC3G2D1N_SIZE                   equ 0001h
CLC3GLS1_LC3G2D1N_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D1N_MASK                   equ 0001h
CLC3GLS1_LC3G2D1T_POSN                   equ 0001h
CLC3GLS1_LC3G2D1T_POSITION               equ 0001h
CLC3GLS1_LC3G2D1T_SIZE                   equ 0001h
CLC3GLS1_LC3G2D1T_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D1T_MASK                   equ 0002h
CLC3GLS1_LC3G2D2N_POSN                   equ 0002h
CLC3GLS1_LC3G2D2N_POSITION               equ 0002h
CLC3GLS1_LC3G2D2N_SIZE                   equ 0001h
CLC3GLS1_LC3G2D2N_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D2N_MASK                   equ 0004h
CLC3GLS1_LC3G2D2T_POSN                   equ 0003h
CLC3GLS1_LC3G2D2T_POSITION               equ 0003h
CLC3GLS1_LC3G2D2T_SIZE                   equ 0001h
CLC3GLS1_LC3G2D2T_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D2T_MASK                   equ 0008h
CLC3GLS1_LC3G2D3N_POSN                   equ 0004h
CLC3GLS1_LC3G2D3N_POSITION               equ 0004h
CLC3GLS1_LC3G2D3N_SIZE                   equ 0001h
CLC3GLS1_LC3G2D3N_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D3N_MASK                   equ 0010h
CLC3GLS1_LC3G2D3T_POSN                   equ 0005h
CLC3GLS1_LC3G2D3T_POSITION               equ 0005h
CLC3GLS1_LC3G2D3T_SIZE                   equ 0001h
CLC3GLS1_LC3G2D3T_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D3T_MASK                   equ 0020h
CLC3GLS1_LC3G2D4N_POSN                   equ 0006h
CLC3GLS1_LC3G2D4N_POSITION               equ 0006h
CLC3GLS1_LC3G2D4N_SIZE                   equ 0001h
CLC3GLS1_LC3G2D4N_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D4N_MASK                   equ 0040h
CLC3GLS1_LC3G2D4T_POSN                   equ 0007h
CLC3GLS1_LC3G2D4T_POSITION               equ 0007h
CLC3GLS1_LC3G2D4T_SIZE                   equ 0001h
CLC3GLS1_LC3G2D4T_LENGTH                 equ 0001h
CLC3GLS1_LC3G2D4T_MASK                   equ 0080h

