GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
// Register: CLC5GLS2
#define CLC5GLS2 CLC5GLS2
CLC5GLS2                                 equ 0E57h
// bitfield definitions
CLC5GLS2_G3D1N_POSN                      equ 0000h
CLC5GLS2_G3D1N_POSITION                  equ 0000h
CLC5GLS2_G3D1N_SIZE                      equ 0001h
CLC5GLS2_G3D1N_LENGTH                    equ 0001h
CLC5GLS2_G3D1N_MASK                      equ 0001h
CLC5GLS2_G3D1T_POSN                      equ 0001h
CLC5GLS2_G3D1T_POSITION                  equ 0001h
CLC5GLS2_G3D1T_SIZE                      equ 0001h
CLC5GLS2_G3D1T_LENGTH                    equ 0001h
CLC5GLS2_G3D1T_MASK                      equ 0002h
CLC5GLS2_G3D2N_POSN                      equ 0002h
CLC5GLS2_G3D2N_POSITION                  equ 0002h
CLC5GLS2_G3D2N_SIZE                      equ 0001h
CLC5GLS2_G3D2N_LENGTH                    equ 0001h
CLC5GLS2_G3D2N_MASK                      equ 0004h
CLC5GLS2_G3D2T_POSN                      equ 0003h
CLC5GLS2_G3D2T_POSITION                  equ 0003h
CLC5GLS2_G3D2T_SIZE                      equ 0001h
CLC5GLS2_G3D2T_LENGTH                    equ 0001h
CLC5GLS2_G3D2T_MASK                      equ 0008h
CLC5GLS2_G3D3N_POSN                      equ 0004h
CLC5GLS2_G3D3N_POSITION                  equ 0004h
CLC5GLS2_G3D3N_SIZE                      equ 0001h
CLC5GLS2_G3D3N_LENGTH                    equ 0001h
CLC5GLS2_G3D3N_MASK                      equ 0010h
CLC5GLS2_G3D3T_POSN                      equ 0005h
CLC5GLS2_G3D3T_POSITION                  equ 0005h
CLC5GLS2_G3D3T_SIZE                      equ 0001h
CLC5GLS2_G3D3T_LENGTH                    equ 0001h
CLC5GLS2_G3D3T_MASK                      equ 0020h
CLC5GLS2_G3D4N_POSN                      equ 0006h
CLC5GLS2_G3D4N_POSITION                  equ 0006h
CLC5GLS2_G3D4N_SIZE                      equ 0001h
CLC5GLS2_G3D4N_LENGTH                    equ 0001h
CLC5GLS2_G3D4N_MASK                      equ 0040h
CLC5GLS2_G3D4T_POSN                      equ 0007h
CLC5GLS2_G3D4T_POSITION                  equ 0007h
CLC5GLS2_G3D4T_SIZE                      equ 0001h
CLC5GLS2_G3D4T_LENGTH                    equ 0001h
CLC5GLS2_G3D4T_MASK                      equ 0080h
CLC5GLS2_LC5G3D1N_POSN                   equ 0000h
CLC5GLS2_LC5G3D1N_POSITION               equ 0000h
CLC5GLS2_LC5G3D1N_SIZE                   equ 0001h
CLC5GLS2_LC5G3D1N_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D1N_MASK                   equ 0001h
CLC5GLS2_LC5G3D1T_POSN                   equ 0001h
CLC5GLS2_LC5G3D1T_POSITION               equ 0001h
CLC5GLS2_LC5G3D1T_SIZE                   equ 0001h
CLC5GLS2_LC5G3D1T_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D1T_MASK                   equ 0002h
CLC5GLS2_LC5G3D2N_POSN                   equ 0002h
CLC5GLS2_LC5G3D2N_POSITION               equ 0002h
CLC5GLS2_LC5G3D2N_SIZE                   equ 0001h
CLC5GLS2_LC5G3D2N_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D2N_MASK                   equ 0004h
CLC5GLS2_LC5G3D2T_POSN                   equ 0003h
CLC5GLS2_LC5G3D2T_POSITION               equ 0003h
CLC5GLS2_LC5G3D2T_SIZE                   equ 0001h
CLC5GLS2_LC5G3D2T_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D2T_MASK                   equ 0008h
CLC5GLS2_LC5G3D3N_POSN                   equ 0004h
CLC5GLS2_LC5G3D3N_POSITION               equ 0004h
CLC5GLS2_LC5G3D3N_SIZE                   equ 0001h
CLC5GLS2_LC5G3D3N_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D3N_MASK                   equ 0010h
CLC5GLS2_LC5G3D3T_POSN                   equ 0005h
CLC5GLS2_LC5G3D3T_POSITION               equ 0005h
CLC5GLS2_LC5G3D3T_SIZE                   equ 0001h
CLC5GLS2_LC5G3D3T_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D3T_MASK                   equ 0020h
CLC5GLS2_LC5G3D4N_POSN                   equ 0006h
CLC5GLS2_LC5G3D4N_POSITION               equ 0006h
CLC5GLS2_LC5G3D4N_SIZE                   equ 0001h
CLC5GLS2_LC5G3D4N_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D4N_MASK                   equ 0040h
CLC5GLS2_LC5G3D4T_POSN                   equ 0007h
CLC5GLS2_LC5G3D4T_POSITION               equ 0007h
CLC5GLS2_LC5G3D4T_SIZE                   equ 0001h
CLC5GLS2_LC5G3D4T_LENGTH                 equ 0001h
CLC5GLS2_LC5G3D4T_MASK                   equ 0080h

// Register: CLC5GLS3
#define CLC5GLS3 CLC5GLS3
CLC5GLS3                                 equ 0E58h
// bitfield definitions
CLC5GLS3_G4D1N_POSN                      equ 0000h
CLC5GLS3_G4D1N_POSITION                  equ 0000h
CLC5GLS3_G4D1N_SIZE                      equ 0001h
CLC5GLS3_G4D1N_LENGTH                    equ 0001h
CLC5GLS3_G4D1N_MASK                      equ 0001h
CLC5GLS3_G4D1T_POSN                      equ 0001h
CLC5GLS3_G4D1T_POSITION                  equ 0001h
CLC5GLS3_G4D1T_SIZE                      equ 0001h
CLC5GLS3_G4D1T_LENGTH                    equ 0001h
CLC5GLS3_G4D1T_MASK                      equ 0002h
CLC5GLS3_G4D2N_POSN                      equ 0002h
CLC5GLS3_G4D2N_POSITION                  equ 0002h
CLC5GLS3_G4D2N_SIZE                      equ 0001h
CLC5GLS3_G4D2N_LENGTH                    equ 0001h
CLC5GLS3_G4D2N_MASK                      equ 0004h
CLC5GLS3_G4D2T_POSN                      equ 0003h
CLC5GLS3_G4D2T_POSITION                  equ 0003h
CLC5GLS3_G4D2T_SIZE                      equ 0001h
CLC5GLS3_G4D2T_LENGTH                    equ 0001h
CLC5GLS3_G4D2T_MASK                      equ 0008h
CLC5GLS3_G4D3N_POSN                      equ 0004h
CLC5GLS3_G4D3N_POSITION                  equ 0004h
CLC5GLS3_G4D3N_SIZE                      equ 0001h
CLC5GLS3_G4D3N_LENGTH                    equ 0001h
CLC5GLS3_G4D3N_MASK                      equ 0010h
CLC5GLS3_G4D3T_POSN                      equ 0005h
CLC5GLS3_G4D3T_POSITION                  equ 0005h
CLC5GLS3_G4D3T_SIZE                      equ 0001h
CLC5GLS3_G4D3T_LENGTH                    equ 0001h
CLC5GLS3_G4D3T_MASK                      equ 0020h
CLC5GLS3_G4D4N_POSN                      equ 0006h
CLC5GLS3_G4D4N_POSITION                  equ 0006h
CLC5GLS3_G4D4N_SIZE                      equ 0001h
CLC5GLS3_G4D4N_LENGTH                    equ 0001h
CLC5GLS3_G4D4N_MASK                      equ 0040h
CLC5GLS3_G4D4T_POSN                      equ 0007h
CLC5GLS3_G4D4T_POSITION                  equ 0007h
CLC5GLS3_G4D4T_SIZE                      equ 0001h
CLC5GLS3_G4D4T_LENGTH                    equ 0001h
CLC5GLS3_G4D4T_MASK                      equ 0080h
CLC5GLS3_LC5G4D1N_POSN                   equ 0000h
CLC5GLS3_LC5G4D1N_POSITION               equ 0000h
CLC5GLS3_LC5G4D1N_SIZE                   equ 0001h
CLC5GLS3_LC5G4D1N_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D1N_MASK                   equ 0001h
CLC5GLS3_LC5G4D1T_POSN                   equ 0001h
CLC5GLS3_LC5G4D1T_POSITION               equ 0001h
CLC5GLS3_LC5G4D1T_SIZE                   equ 0001h
CLC5GLS3_LC5G4D1T_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D1T_MASK                   equ 0002h
CLC5GLS3_LC5G4D2N_POSN                   equ 0002h
CLC5GLS3_LC5G4D2N_POSITION               equ 0002h
CLC5GLS3_LC5G4D2N_SIZE                   equ 0001h
CLC5GLS3_LC5G4D2N_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D2N_MASK                   equ 0004h
CLC5GLS3_LC5G4D2T_POSN                   equ 0003h
CLC5GLS3_LC5G4D2T_POSITION               equ 0003h
CLC5GLS3_LC5G4D2T_SIZE                   equ 0001h
CLC5GLS3_LC5G4D2T_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D2T_MASK                   equ 0008h
CLC5GLS3_LC5G4D3N_POSN                   equ 0004h
CLC5GLS3_LC5G4D3N_POSITION               equ 0004h
CLC5GLS3_LC5G4D3N_SIZE                   equ 0001h
CLC5GLS3_LC5G4D3N_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D3N_MASK                   equ 0010h
CLC5GLS3_LC5G4D3T_POSN                   equ 0005h
CLC5GLS3_LC5G4D3T_POSITION               equ 0005h
CLC5GLS3_LC5G4D3T_SIZE                   equ 0001h
CLC5GLS3_LC5G4D3T_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D3T_MASK                   equ 0020h
CLC5GLS3_LC5G4D4N_POSN                   equ 0006h
CLC5GLS3_LC5G4D4N_POSITION               equ 0006h
CLC5GLS3_LC5G4D4N_SIZE                   equ 0001h
CLC5GLS3_LC5G4D4N_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D4N_MASK                   equ 0040h
CLC5GLS3_LC5G4D4T_POSN                   equ 0007h
CLC5GLS3_LC5G4D4T_POSITION               equ 0007h
CLC5GLS3_LC5G4D4T_SIZE                   equ 0001h
CLC5GLS3_LC5G4D4T_LENGTH                 equ 0001h
CLC5GLS3_LC5G4D4T_MASK                   equ 0080h

// Register: CLC6CON
#define CLC6CON CLC6CON
CLC6CON                                  equ 0E59h
// bitfield definitions
CLC6CON_MODE_POSN                        equ 0000h
CLC6CON_MODE_POSITION                    equ 0000h
CLC6CON_MODE_SIZE                        equ 0003h
CLC6CON_MODE_LENGTH                      equ 0003h
CLC6CON_MODE_MASK                        equ 0007h
CLC6CON_INTN_POSN                        equ 0003h
CLC6CON_INTN_POSITION                    equ 0003h
CLC6CON_INTN_SIZE                        equ 0001h
CLC6CON_INTN_LENGTH                      equ 0001h
CLC6CON_INTN_MASK                        equ 0008h
CLC6CON_INTP_POSN                        equ 0004h
CLC6CON_INTP_POSITION                    equ 0004h
CLC6CON_INTP_SIZE                        equ 0001h
CLC6CON_INTP_LENGTH                      equ 0001h
CLC6CON_INTP_MASK                        equ 0010h
CLC6CON_OUT_POSN                         equ 0005h
CLC6CON_OUT_POSITION                     equ 0005h
CLC6CON_OUT_SIZE                         equ 0001h
CLC6CON_OUT_LENGTH                       equ 0001h
CLC6CON_OUT_MASK                         equ 0020h
CLC6CON_EN_POSN                          equ 0007h
CLC6CON_EN_POSITION                      equ 0007h
CLC6CON_EN_SIZE                          equ 0001h
CLC6CON_EN_LENGTH                        equ 0001h
CLC6CON_EN_MASK                          equ 0080h
CLC6CON_MODE0_POSN                       equ 0000h
CLC6CON_MODE0_POSITION                   equ 0000h
CLC6CON_MODE0_SIZE                       equ 0001h
CLC6CON_MODE0_LENGTH                     equ 0001h
CLC6CON_MODE0_MASK                       equ 0001h
CLC6CON_MODE1_POSN                       equ 0001h
CLC6CON_MODE1_POSITION                   equ 0001h
CLC6CON_MODE1_SIZE                       equ 0001h
CLC6CON_MODE1_LENGTH                     equ 0001h
CLC6CON_MODE1_MASK                       equ 0002h
CLC6CON_MODE2_POSN                       equ 0002h
CLC6CON_MODE2_POSITION                   equ 0002h
CLC6CON_MODE2_SIZE                       equ 0001h
CLC6CON_MODE2_LENGTH                     equ 0001h
CLC6CON_MODE2_MASK                       equ 0004h
CLC6CON_LC6MODE_POSN                     equ 0000h
CLC6CON_LC6MODE_POSITION                 equ 0000h
CLC6CON_LC6MODE_SIZE                     equ 0003h
CLC6CON_LC6MODE_LENGTH                   equ 0003h
CLC6CON_LC6MODE_MASK                     equ 0007h
CLC6CON_LC6INTN_POSN                     equ 0003h
CLC6CON_LC6INTN_POSITION                 equ 0003h
CLC6CON_LC6INTN_SIZE                     equ 0001h
CLC6CON_LC6INTN_LENGTH                   equ 0001h
CLC6CON_LC6INTN_MASK                     equ 0008h
CLC6CON_LC6INTP_POSN                     equ 0004h
CLC6CON_LC6INTP_POSITION                 equ 0004h
CLC6CON_LC6INTP_SIZE                     equ 0001h
CLC6CON_LC6INTP_LENGTH                   equ 0001h
CLC6CON_LC6INTP_MASK                     equ 0010h
CLC6CON_LC6OUT_POSN                      equ 0005h
CLC6CON_LC6OUT_POSITION                  equ 0005h
CLC6CON_LC6OUT_SIZE                      equ 0001h
CLC6CON_LC6OUT_LENGTH                    equ 0001h
CLC6CON_LC6OUT_MASK                      equ 0020h
CLC6CON_LC6EN_POSN                       equ 0007h
CLC6CON_LC6EN_POSITION                   equ 0007h
CLC6CON_LC6EN_SIZE                       equ 0001h
CLC6CON_LC6EN_LENGTH                     equ 0001h
CLC6CON_LC6EN_MASK                       equ 0080h
CLC6CON_LC6MODE0_POSN                    equ 0000h
CLC6CON_LC6MODE0_POSITION                equ 0000h
CLC6CON_LC6MODE0_SIZE                    equ 0001h
CLC6CON_LC6MODE0_LENGTH                  equ 0001h
CLC6CON_LC6MODE0_MASK                    equ 0001h
CLC6CON_LC6MODE1_POSN                    equ 0001h
CLC6CON_LC6MODE1_POSITION                equ 0001h
CLC6CON_LC6MODE1_SIZE                    equ 0001h
CLC6CON_LC6MODE1_LENGTH                  equ 0001h
CLC6CON_LC6MODE1_MASK                    equ 0002h
CLC6CON_LC6MODE2_POSN                    equ 0002h
CLC6CON_LC6MODE2_POSITION                equ 0002h
CLC6CON_LC6MODE2_SIZE                    equ 0001h
CLC6CON_LC6MODE2_LENGTH                  equ 0001h
CLC6CON_LC6MODE2_MASK                    equ 0004h

