GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
// Register: CLC8GLS3
#define CLC8GLS3 CLC8GLS3
CLC8GLS3                                 equ 0E76h
// bitfield definitions
CLC8GLS3_G4D1N_POSN                      equ 0000h
CLC8GLS3_G4D1N_POSITION                  equ 0000h
CLC8GLS3_G4D1N_SIZE                      equ 0001h
CLC8GLS3_G4D1N_LENGTH                    equ 0001h
CLC8GLS3_G4D1N_MASK                      equ 0001h
CLC8GLS3_G4D1T_POSN                      equ 0001h
CLC8GLS3_G4D1T_POSITION                  equ 0001h
CLC8GLS3_G4D1T_SIZE                      equ 0001h
CLC8GLS3_G4D1T_LENGTH                    equ 0001h
CLC8GLS3_G4D1T_MASK                      equ 0002h
CLC8GLS3_G4D2N_POSN                      equ 0002h
CLC8GLS3_G4D2N_POSITION                  equ 0002h
CLC8GLS3_G4D2N_SIZE                      equ 0001h
CLC8GLS3_G4D2N_LENGTH                    equ 0001h
CLC8GLS3_G4D2N_MASK                      equ 0004h
CLC8GLS3_G4D2T_POSN                      equ 0003h
CLC8GLS3_G4D2T_POSITION                  equ 0003h
CLC8GLS3_G4D2T_SIZE                      equ 0001h
CLC8GLS3_G4D2T_LENGTH                    equ 0001h
CLC8GLS3_G4D2T_MASK                      equ 0008h
CLC8GLS3_G4D3N_POSN                      equ 0004h
CLC8GLS3_G4D3N_POSITION                  equ 0004h
CLC8GLS3_G4D3N_SIZE                      equ 0001h
CLC8GLS3_G4D3N_LENGTH                    equ 0001h
CLC8GLS3_G4D3N_MASK                      equ 0010h
CLC8GLS3_G4D3T_POSN                      equ 0005h
CLC8GLS3_G4D3T_POSITION                  equ 0005h
CLC8GLS3_G4D3T_SIZE                      equ 0001h
CLC8GLS3_G4D3T_LENGTH                    equ 0001h
CLC8GLS3_G4D3T_MASK                      equ 0020h
CLC8GLS3_G4D4N_POSN                      equ 0006h
CLC8GLS3_G4D4N_POSITION                  equ 0006h
CLC8GLS3_G4D4N_SIZE                      equ 0001h
CLC8GLS3_G4D4N_LENGTH                    equ 0001h
CLC8GLS3_G4D4N_MASK                      equ 0040h
CLC8GLS3_G4D4T_POSN                      equ 0007h
CLC8GLS3_G4D4T_POSITION                  equ 0007h
CLC8GLS3_G4D4T_SIZE                      equ 0001h
CLC8GLS3_G4D4T_LENGTH                    equ 0001h
CLC8GLS3_G4D4T_MASK                      equ 0080h
CLC8GLS3_LC8G4D1N_POSN                   equ 0000h
CLC8GLS3_LC8G4D1N_POSITION               equ 0000h
CLC8GLS3_LC8G4D1N_SIZE                   equ 0001h
CLC8GLS3_LC8G4D1N_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D1N_MASK                   equ 0001h
CLC8GLS3_LC8G4D1T_POSN                   equ 0001h
CLC8GLS3_LC8G4D1T_POSITION               equ 0001h
CLC8GLS3_LC8G4D1T_SIZE                   equ 0001h
CLC8GLS3_LC8G4D1T_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D1T_MASK                   equ 0002h
CLC8GLS3_LC8G4D2N_POSN                   equ 0002h
CLC8GLS3_LC8G4D2N_POSITION               equ 0002h
CLC8GLS3_LC8G4D2N_SIZE                   equ 0001h
CLC8GLS3_LC8G4D2N_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D2N_MASK                   equ 0004h
CLC8GLS3_LC8G4D2T_POSN                   equ 0003h
CLC8GLS3_LC8G4D2T_POSITION               equ 0003h
CLC8GLS3_LC8G4D2T_SIZE                   equ 0001h
CLC8GLS3_LC8G4D2T_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D2T_MASK                   equ 0008h
CLC8GLS3_LC8G4D3N_POSN                   equ 0004h
CLC8GLS3_LC8G4D3N_POSITION               equ 0004h
CLC8GLS3_LC8G4D3N_SIZE                   equ 0001h
CLC8GLS3_LC8G4D3N_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D3N_MASK                   equ 0010h
CLC8GLS3_LC8G4D3T_POSN                   equ 0005h
CLC8GLS3_LC8G4D3T_POSITION               equ 0005h
CLC8GLS3_LC8G4D3T_SIZE                   equ 0001h
CLC8GLS3_LC8G4D3T_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D3T_MASK                   equ 0020h
CLC8GLS3_LC8G4D4N_POSN                   equ 0006h
CLC8GLS3_LC8G4D4N_POSITION               equ 0006h
CLC8GLS3_LC8G4D4N_SIZE                   equ 0001h
CLC8GLS3_LC8G4D4N_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D4N_MASK                   equ 0040h
CLC8GLS3_LC8G4D4T_POSN                   equ 0007h
CLC8GLS3_LC8G4D4T_POSITION               equ 0007h
CLC8GLS3_LC8G4D4T_SIZE                   equ 0001h
CLC8GLS3_LC8G4D4T_LENGTH                 equ 0001h
CLC8GLS3_LC8G4D4T_MASK                   equ 0080h

// Register: CLCDATA
#define CLCDATA CLCDATA
CLCDATA                                  equ 0E77h
// bitfield definitions
CLCDATA_MCL1OUT_POSN                     equ 0000h
CLCDATA_MCL1OUT_POSITION                 equ 0000h
CLCDATA_MCL1OUT_SIZE                     equ 0001h
CLCDATA_MCL1OUT_LENGTH                   equ 0001h
CLCDATA_MCL1OUT_MASK                     equ 0001h
CLCDATA_MLC2OUT_POSN                     equ 0001h
CLCDATA_MLC2OUT_POSITION                 equ 0001h
CLCDATA_MLC2OUT_SIZE                     equ 0001h
CLCDATA_MLC2OUT_LENGTH                   equ 0001h
CLCDATA_MLC2OUT_MASK                     equ 0002h
CLCDATA_MLC3OUT_POSN                     equ 0002h
CLCDATA_MLC3OUT_POSITION                 equ 0002h
CLCDATA_MLC3OUT_SIZE                     equ 0001h
CLCDATA_MLC3OUT_LENGTH                   equ 0001h
CLCDATA_MLC3OUT_MASK                     equ 0004h
CLCDATA_MLC4OUT_POSN                     equ 0003h
CLCDATA_MLC4OUT_POSITION                 equ 0003h
CLCDATA_MLC4OUT_SIZE                     equ 0001h
CLCDATA_MLC4OUT_LENGTH                   equ 0001h
CLCDATA_MLC4OUT_MASK                     equ 0008h
CLCDATA_MLC5OUT_POSN                     equ 0004h
CLCDATA_MLC5OUT_POSITION                 equ 0004h
CLCDATA_MLC5OUT_SIZE                     equ 0001h
CLCDATA_MLC5OUT_LENGTH                   equ 0001h
CLCDATA_MLC5OUT_MASK                     equ 0010h
CLCDATA_MLC6OUT_POSN                     equ 0005h
CLCDATA_MLC6OUT_POSITION                 equ 0005h
CLCDATA_MLC6OUT_SIZE                     equ 0001h
CLCDATA_MLC6OUT_LENGTH                   equ 0001h
CLCDATA_MLC6OUT_MASK                     equ 0020h
CLCDATA_MLC7OUT_POSN                     equ 0006h
CLCDATA_MLC7OUT_POSITION                 equ 0006h
CLCDATA_MLC7OUT_SIZE                     equ 0001h
CLCDATA_MLC7OUT_LENGTH                   equ 0001h
CLCDATA_MLC7OUT_MASK                     equ 0040h
CLCDATA_MLC8OUT_POSN                     equ 0007h
CLCDATA_MLC8OUT_POSITION                 equ 0007h
CLCDATA_MLC8OUT_SIZE                     equ 0001h
CLCDATA_MLC8OUT_LENGTH                   equ 0001h
CLCDATA_MLC8OUT_MASK                     equ 0080h

// Register: RX2PPS
#define RX2PPS RX2PPS
RX2PPS                                   equ 0E88h
// bitfield definitions
RX2PPS_PORT_POSN                         equ 0000h
RX2PPS_PORT_POSITION                     equ 0000h
RX2PPS_PORT_SIZE                         equ 0003h
RX2PPS_PORT_LENGTH                       equ 0003h
RX2PPS_PORT_MASK                         equ 0007h
RX2PPS_PIN_POSN                          equ 0003h
RX2PPS_PIN_POSITION                      equ 0003h
RX2PPS_PIN_SIZE                          equ 0002h
RX2PPS_PIN_LENGTH                        equ 0002h
RX2PPS_PIN_MASK                          equ 0018h
RX2PPS_RX2PPS_POSN                       equ 0000h
RX2PPS_RX2PPS_POSITION                   equ 0000h
RX2PPS_RX2PPS_SIZE                       equ 0005h
RX2PPS_RX2PPS_LENGTH                     equ 0005h
RX2PPS_RX2PPS_MASK                       equ 001Fh
RX2PPS_RX2PPS0_POSN                      equ 0000h
RX2PPS_RX2PPS0_POSITION                  equ 0000h
RX2PPS_RX2PPS0_SIZE                      equ 0001h
RX2PPS_RX2PPS0_LENGTH                    equ 0001h
RX2PPS_RX2PPS0_MASK                      equ 0001h
RX2PPS_RX2PPS1_POSN                      equ 0001h
RX2PPS_RX2PPS1_POSITION                  equ 0001h
RX2PPS_RX2PPS1_SIZE                      equ 0001h
RX2PPS_RX2PPS1_LENGTH                    equ 0001h
RX2PPS_RX2PPS1_MASK                      equ 0002h
RX2PPS_RX2PPS2_POSN                      equ 0002h
RX2PPS_RX2PPS2_POSITION                  equ 0002h
RX2PPS_RX2PPS2_SIZE                      equ 0001h
RX2PPS_RX2PPS2_LENGTH                    equ 0001h
RX2PPS_RX2PPS2_MASK                      equ 0004h
RX2PPS_RX2PPS3_POSN                      equ 0003h
RX2PPS_RX2PPS3_POSITION                  equ 0003h
RX2PPS_RX2PPS3_SIZE                      equ 0001h
RX2PPS_RX2PPS3_LENGTH                    equ 0001h
RX2PPS_RX2PPS3_MASK                      equ 0008h
RX2PPS_RX2PPS4_POSN                      equ 0004h
RX2PPS_RX2PPS4_POSITION                  equ 0004h
RX2PPS_RX2PPS4_SIZE                      equ 0001h
RX2PPS_RX2PPS4_LENGTH                    equ 0001h
RX2PPS_RX2PPS4_MASK                      equ 0010h

// Register: CK2PPS
#define CK2PPS CK2PPS
CK2PPS                                   equ 0E89h
// bitfield definitions
CK2PPS_PORT_POSN                         equ 0000h
CK2PPS_PORT_POSITION                     equ 0000h
CK2PPS_PORT_SIZE                         equ 0003h
CK2PPS_PORT_LENGTH                       equ 0003h
CK2PPS_PORT_MASK                         equ 0007h
CK2PPS_PIN_POSN                          equ 0003h
CK2PPS_PIN_POSITION                      equ 0003h
CK2PPS_PIN_SIZE                          equ 0002h
CK2PPS_PIN_LENGTH                        equ 0002h
CK2PPS_PIN_MASK                          equ 0018h
CK2PPS_CK2PPS0_POSN                      equ 0000h
CK2PPS_CK2PPS0_POSITION                  equ 0000h
CK2PPS_CK2PPS0_SIZE                      equ 0001h
CK2PPS_CK2PPS0_LENGTH                    equ 0001h
CK2PPS_CK2PPS0_MASK                      equ 0001h
CK2PPS_CK2PPS1_POSN                      equ 0001h
CK2PPS_CK2PPS1_POSITION                  equ 0001h
CK2PPS_CK2PPS1_SIZE                      equ 0001h
CK2PPS_CK2PPS1_LENGTH                    equ 0001h
CK2PPS_CK2PPS1_MASK                      equ 0002h
CK2PPS_CK2PPS2_POSN                      equ 0002h
CK2PPS_CK2PPS2_POSITION                  equ 0002h
CK2PPS_CK2PPS2_SIZE                      equ 0001h
CK2PPS_CK2PPS2_LENGTH                    equ 0001h
CK2PPS_CK2PPS2_MASK                      equ 0004h
CK2PPS_CK2PPS3_POSN                      equ 0003h
CK2PPS_CK2PPS3_POSITION                  equ 0003h
CK2PPS_CK2PPS3_SIZE                      equ 0001h
CK2PPS_CK2PPS3_LENGTH                    equ 0001h
CK2PPS_CK2PPS3_MASK                      equ 0008h
CK2PPS_CK2PPS4_POSN                      equ 0004h
CK2PPS_CK2PPS4_POSITION                  equ 0004h
CK2PPS_CK2PPS4_SIZE                      equ 0001h
CK2PPS_CK2PPS4_LENGTH                    equ 0001h
CK2PPS_CK2PPS4_MASK                      equ 0010h
CK2PPS_CK2PPS_POSN                       equ 0000h
CK2PPS_CK2PPS_POSITION                   equ 0000h
CK2PPS_CK2PPS_SIZE                       equ 0005h
CK2PPS_CK2PPS_LENGTH                     equ 0005h
CK2PPS_CK2PPS_MASK                       equ 001Fh

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 0E8Ah
// bitfield definitions
SSP2CLKPPS_PIN_POSN                      equ 0000h
SSP2CLKPPS_PIN_POSITION                  equ 0000h
SSP2CLKPPS_PIN_SIZE                      equ 0003h
SSP2CLKPPS_PIN_LENGTH                    equ 0003h
SSP2CLKPPS_PIN_MASK                      equ 0007h
SSP2CLKPPS_PORT_POSN                     equ 0003h
SSP2CLKPPS_PORT_POSITION                 equ 0003h
SSP2CLKPPS_PORT_SIZE                     equ 0002h
SSP2CLKPPS_PORT_LENGTH                   equ 0002h
SSP2CLKPPS_PORT_MASK                     equ 0018h
SSP2CLKPPS_SSP2CLKPPS0_POSN              equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_POSITION          equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_MASK              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSN              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSITION          equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_MASK              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSN              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSITION          equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_MASK              equ 0004h
SSP2CLKPPS_SSP2CLKPPS3_POSN              equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_POSITION          equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_MASK              equ 0008h
SSP2CLKPPS_SSP2CLKPPS4_POSN              equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_POSITION          equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_MASK              equ 0010h
SSP2CLKPPS_SSP2PPS_POSN                  equ 0000h
SSP2CLKPPS_SSP2PPS_POSITION              equ 0000h
SSP2CLKPPS_SSP2PPS_SIZE                  equ 0005h
SSP2CLKPPS_SSP2PPS_LENGTH                equ 0005h
SSP2CLKPPS_SSP2PPS_MASK                  equ 001Fh

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 0E8Bh
// bitfield definitions
SSP2DATPPS_PIN_POSN                      equ 0000h
SSP2DATPPS_PIN_POSITION                  equ 0000h
SSP2DATPPS_PIN_SIZE                      equ 0003h
SSP2DATPPS_PIN_LENGTH                    equ 0003h
SSP2DATPPS_PIN_MASK                      equ 0007h
SSP2DATPPS_PORT_POSN                     equ 0003h
SSP2DATPPS_PORT_POSITION                 equ 0003h
SSP2DATPPS_PORT_SIZE                     equ 0002h
SSP2DATPPS_PORT_LENGTH                   equ 0002h
SSP2DATPPS_PORT_MASK                     equ 0018h
SSP2DATPPS_SSP2DATPPS0_POSN              equ 0000h
SSP2DATPPS_SSP2DATPPS0_POSITION          equ 0000h
SSP2DATPPS_SSP2DATPPS0_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS0_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS0_MASK              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSN              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSITION          equ 0001h
SSP2DATPPS_SSP2DATPPS1_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS1_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS1_MASK              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSN              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSITION          equ 0002h
SSP2DATPPS_SSP2DATPPS2_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS2_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS2_MASK              equ 0004h
SSP2DATPPS_SSP2DATPPS3_POSN              equ 0003h
SSP2DATPPS_SSP2DATPPS3_POSITION          equ 0003h
SSP2DATPPS_SSP2DATPPS3_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS3_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS3_MASK              equ 0008h
SSP2DATPPS_SSP2DATPPS4_POSN              equ 0004h
SSP2DATPPS_SSP2DATPPS4_POSITION          equ 0004h
SSP2DATPPS_SSP2DATPPS4_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS4_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS4_MASK              equ 0010h
SSP2DATPPS_SSP2DATPPS_POSN               equ 0000h
SSP2DATPPS_SSP2DATPPS_POSITION           equ 0000h
SSP2DATPPS_SSP2DATPPS_SIZE               equ 0005h
SSP2DATPPS_SSP2DATPPS_LENGTH             equ 0005h
SSP2DATPPS_SSP2DATPPS_MASK               equ 001Fh

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 0E8Ch
// bitfield definitions
SSP2SSPPS_PIN_POSN                       equ 0000h
SSP2SSPPS_PIN_POSITION                   equ 0000h
SSP2SSPPS_PIN_SIZE                       equ 0003h
SSP2SSPPS_PIN_LENGTH                     equ 0003h
SSP2SSPPS_PIN_MASK                       equ 0007h
SSP2SSPPS_PORT_POSN                      equ 0003h
SSP2SSPPS_PORT_POSITION                  equ 0003h
SSP2SSPPS_PORT_SIZE                      equ 0002h
SSP2SSPPS_PORT_LENGTH                    equ 0002h
SSP2SSPPS_PORT_MASK                      equ 0018h
SSP2SSPPS_SSP2SSPPS0_POSN                equ 0000h
SSP2SSPPS_SSP2SSPPS0_POSITION            equ 0000h
SSP2SSPPS_SSP2SSPPS0_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS0_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS0_MASK                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSN                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSITION            equ 0001h
SSP2SSPPS_SSP2SSPPS1_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS1_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS1_MASK                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSN                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSITION            equ 0002h
SSP2SSPPS_SSP2SSPPS2_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS2_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS2_MASK                equ 0004h
SSP2SSPPS_SSP2SSPPS3_POSN                equ 0003h
SSP2SSPPS_SSP2SSPPS3_POSITION            equ 0003h
SSP2SSPPS_SSP2SSPPS3_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS3_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS3_MASK                equ 0008h
SSP2SSPPS_SSP2SSPPS4_POSN                equ 0004h
SSP2SSPPS_SSP2SSPPS4_POSITION            equ 0004h
SSP2SSPPS_SSP2SSPPS4_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS4_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS4_MASK                equ 0010h
SSP2SSPPS_SSP2SSPPS_POSN                 equ 0000h
SSP2SSPPS_SSP2SSPPS_POSITION             equ 0000h
SSP2SSPPS_SSP2SSPPS_SIZE                 equ 0005h
SSP2SSPPS_SSP2SSPPS_LENGTH               equ 0005h
SSP2SSPPS_SSP2SSPPS_MASK                 equ 001Fh

// Register: SSP2BUF
#define SSP2BUF SSP2BUF
SSP2BUF                                  equ 0E8Dh
// bitfield definitions
SSP2BUF_SSPBUF_POSN                      equ 0000h
SSP2BUF_SSPBUF_POSITION                  equ 0000h
SSP2BUF_SSPBUF_SIZE                      equ 0008h
SSP2BUF_SSPBUF_LENGTH                    equ 0008h
SSP2BUF_SSPBUF_MASK                      equ 00FFh

// Register: SSP2ADD
#define SSP2ADD SSP2ADD
SSP2ADD                                  equ 0E8Eh
// bitfield definitions
SSP2ADD_SSPADD_POSN                      equ 0000h
SSP2ADD_SSPADD_POSITION                  equ 0000h
SSP2ADD_SSPADD_SIZE                      equ 0008h
SSP2ADD_SSPADD_LENGTH                    equ 0008h
SSP2ADD_SSPADD_MASK                      equ 00FFh
SSP2ADD_MSK0_POSN                        equ 0000h
SSP2ADD_MSK0_POSITION                    equ 0000h
SSP2ADD_MSK0_SIZE                        equ 0001h
SSP2ADD_MSK0_LENGTH                      equ 0001h
SSP2ADD_MSK0_MASK                        equ 0001h
SSP2ADD_MSK1_POSN                        equ 0001h
SSP2ADD_MSK1_POSITION                    equ 0001h
SSP2ADD_MSK1_SIZE                        equ 0001h
SSP2ADD_MSK1_LENGTH                      equ 0001h
SSP2ADD_MSK1_MASK                        equ 0002h
SSP2ADD_MSK2_POSN                        equ 0002h
SSP2ADD_MSK2_POSITION                    equ 0002h
SSP2ADD_MSK2_SIZE                        equ 0001h
SSP2ADD_MSK2_LENGTH                      equ 0001h
SSP2ADD_MSK2_MASK                        equ 0004h
SSP2ADD_MSK3_POSN                        equ 0003h
SSP2ADD_MSK3_POSITION                    equ 0003h
SSP2ADD_MSK3_SIZE                        equ 0001h
SSP2ADD_MSK3_LENGTH                      equ 0001h
SSP2ADD_MSK3_MASK                        equ 0008h
SSP2ADD_MSK4_POSN                        equ 0004h
SSP2ADD_MSK4_POSITION                    equ 0004h
SSP2ADD_MSK4_SIZE                        equ 0001h
SSP2ADD_MSK4_LENGTH                      equ 0001h
SSP2ADD_MSK4_MASK                        equ 0010h
SSP2ADD_MSK5_POSN                        equ 0005h
SSP2ADD_MSK5_POSITION                    equ 0005h
SSP2ADD_MSK5_SIZE                        equ 0001h
SSP2ADD_MSK5_LENGTH                      equ 0001h
SSP2ADD_MSK5_MASK                        equ 0020h
SSP2ADD_MSK6_POSN                        equ 0006h
SSP2ADD_MSK6_POSITION                    equ 0006h
SSP2ADD_MSK6_SIZE                        equ 0001h
SSP2ADD_MSK6_LENGTH                      equ 0001h
SSP2ADD_MSK6_MASK                        equ 0040h
SSP2ADD_MSK7_POSN                        equ 0007h
SSP2ADD_MSK7_POSITION                    equ 0007h
SSP2ADD_MSK7_SIZE                        equ 0001h
SSP2ADD_MSK7_LENGTH                      equ 0001h
SSP2ADD_MSK7_MASK                        equ 0080h
SSP2ADD_MSK02_POSN                       equ 0000h
SSP2ADD_MSK02_POSITION                   equ 0000h
SSP2ADD_MSK02_SIZE                       equ 0001h
SSP2ADD_MSK02_LENGTH                     equ 0001h
SSP2ADD_MSK02_MASK                       equ 0001h
SSP2ADD_MSK12_POSN                       equ 0001h
SSP2ADD_MSK12_POSITION                   equ 0001h
SSP2ADD_MSK12_SIZE                       equ 0001h
SSP2ADD_MSK12_LENGTH                     equ 0001h
SSP2ADD_MSK12_MASK                       equ 0002h
SSP2ADD_MSK22_POSN                       equ 0002h
SSP2ADD_MSK22_POSITION                   equ 0002h
SSP2ADD_MSK22_SIZE                       equ 0001h
SSP2ADD_MSK22_LENGTH                     equ 0001h
SSP2ADD_MSK22_MASK                       equ 0004h
SSP2ADD_MSK32_POSN                       equ 0003h
SSP2ADD_MSK32_POSITION                   equ 0003h
SSP2ADD_MSK32_SIZE                       equ 0001h
SSP2ADD_MSK32_LENGTH                     equ 0001h
SSP2ADD_MSK32_MASK                       equ 0008h
SSP2ADD_MSK42_POSN                       equ 0004h
SSP2ADD_MSK42_POSITION                   equ 0004h
SSP2ADD_MSK42_SIZE                       equ 0001h
SSP2ADD_MSK42_LENGTH                     equ 0001h
SSP2ADD_MSK42_MASK                       equ 0010h
SSP2ADD_MSK52_POSN                       equ 0005h
SSP2ADD_MSK52_POSITION                   equ 0005h
SSP2ADD_MSK52_SIZE                       equ 0001h
SSP2ADD_MSK52_LENGTH                     equ 0001h
SSP2ADD_MSK52_MASK                       equ 0020h
SSP2ADD_MSK62_POSN                       equ 0006h
SSP2ADD_MSK62_POSITION                   equ 0006h
SSP2ADD_MSK62_SIZE                       equ 0001h
SSP2ADD_MSK62_LENGTH                     equ 0001h
SSP2ADD_MSK62_MASK                       equ 0040h
SSP2ADD_MSK72_POSN                       equ 0007h
SSP2ADD_MSK72_POSITION                   equ 0007h
SSP2ADD_MSK72_SIZE                       equ 0001h
SSP2ADD_MSK72_LENGTH                     equ 0001h
SSP2ADD_MSK72_MASK                       equ 0080h

