GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
// Register: RC3PPS
#define RC3PPS RC3PPS
RC3PPS                                   equ 0EF5h
// bitfield definitions
RC3PPS_RC3PPS0_POSN                      equ 0000h
RC3PPS_RC3PPS0_POSITION                  equ 0000h
RC3PPS_RC3PPS0_SIZE                      equ 0001h
RC3PPS_RC3PPS0_LENGTH                    equ 0001h
RC3PPS_RC3PPS0_MASK                      equ 0001h
RC3PPS_RC3PPS1_POSN                      equ 0001h
RC3PPS_RC3PPS1_POSITION                  equ 0001h
RC3PPS_RC3PPS1_SIZE                      equ 0001h
RC3PPS_RC3PPS1_LENGTH                    equ 0001h
RC3PPS_RC3PPS1_MASK                      equ 0002h
RC3PPS_RC3PPS2_POSN                      equ 0002h
RC3PPS_RC3PPS2_POSITION                  equ 0002h
RC3PPS_RC3PPS2_SIZE                      equ 0001h
RC3PPS_RC3PPS2_LENGTH                    equ 0001h
RC3PPS_RC3PPS2_MASK                      equ 0004h
RC3PPS_RC3PPS3_POSN                      equ 0003h
RC3PPS_RC3PPS3_POSITION                  equ 0003h
RC3PPS_RC3PPS3_SIZE                      equ 0001h
RC3PPS_RC3PPS3_LENGTH                    equ 0001h
RC3PPS_RC3PPS3_MASK                      equ 0008h
RC3PPS_RC3PPS4_POSN                      equ 0004h
RC3PPS_RC3PPS4_POSITION                  equ 0004h
RC3PPS_RC3PPS4_SIZE                      equ 0001h
RC3PPS_RC3PPS4_LENGTH                    equ 0001h
RC3PPS_RC3PPS4_MASK                      equ 0010h

// Register: RC4PPS
#define RC4PPS RC4PPS
RC4PPS                                   equ 0EF6h
// bitfield definitions
RC4PPS_RC4PPS0_POSN                      equ 0000h
RC4PPS_RC4PPS0_POSITION                  equ 0000h
RC4PPS_RC4PPS0_SIZE                      equ 0001h
RC4PPS_RC4PPS0_LENGTH                    equ 0001h
RC4PPS_RC4PPS0_MASK                      equ 0001h
RC4PPS_RC4PPS1_POSN                      equ 0001h
RC4PPS_RC4PPS1_POSITION                  equ 0001h
RC4PPS_RC4PPS1_SIZE                      equ 0001h
RC4PPS_RC4PPS1_LENGTH                    equ 0001h
RC4PPS_RC4PPS1_MASK                      equ 0002h
RC4PPS_RC4PPS2_POSN                      equ 0002h
RC4PPS_RC4PPS2_POSITION                  equ 0002h
RC4PPS_RC4PPS2_SIZE                      equ 0001h
RC4PPS_RC4PPS2_LENGTH                    equ 0001h
RC4PPS_RC4PPS2_MASK                      equ 0004h
RC4PPS_RC4PPS3_POSN                      equ 0003h
RC4PPS_RC4PPS3_POSITION                  equ 0003h
RC4PPS_RC4PPS3_SIZE                      equ 0001h
RC4PPS_RC4PPS3_LENGTH                    equ 0001h
RC4PPS_RC4PPS3_MASK                      equ 0008h
RC4PPS_RC4PPS4_POSN                      equ 0004h
RC4PPS_RC4PPS4_POSITION                  equ 0004h
RC4PPS_RC4PPS4_SIZE                      equ 0001h
RC4PPS_RC4PPS4_LENGTH                    equ 0001h
RC4PPS_RC4PPS4_MASK                      equ 0010h

// Register: RC5PPS
#define RC5PPS RC5PPS
RC5PPS                                   equ 0EF7h
// bitfield definitions
RC5PPS_RC5PPS0_POSN                      equ 0000h
RC5PPS_RC5PPS0_POSITION                  equ 0000h
RC5PPS_RC5PPS0_SIZE                      equ 0001h
RC5PPS_RC5PPS0_LENGTH                    equ 0001h
RC5PPS_RC5PPS0_MASK                      equ 0001h
RC5PPS_RC5PPS1_POSN                      equ 0001h
RC5PPS_RC5PPS1_POSITION                  equ 0001h
RC5PPS_RC5PPS1_SIZE                      equ 0001h
RC5PPS_RC5PPS1_LENGTH                    equ 0001h
RC5PPS_RC5PPS1_MASK                      equ 0002h
RC5PPS_RC5PPS2_POSN                      equ 0002h
RC5PPS_RC5PPS2_POSITION                  equ 0002h
RC5PPS_RC5PPS2_SIZE                      equ 0001h
RC5PPS_RC5PPS2_LENGTH                    equ 0001h
RC5PPS_RC5PPS2_MASK                      equ 0004h
RC5PPS_RC5PPS3_POSN                      equ 0003h
RC5PPS_RC5PPS3_POSITION                  equ 0003h
RC5PPS_RC5PPS3_SIZE                      equ 0001h
RC5PPS_RC5PPS3_LENGTH                    equ 0001h
RC5PPS_RC5PPS3_MASK                      equ 0008h
RC5PPS_RC5PPS4_POSN                      equ 0004h
RC5PPS_RC5PPS4_POSITION                  equ 0004h
RC5PPS_RC5PPS4_SIZE                      equ 0001h
RC5PPS_RC5PPS4_LENGTH                    equ 0001h
RC5PPS_RC5PPS4_MASK                      equ 0010h

// Register: RC6PPS
#define RC6PPS RC6PPS
RC6PPS                                   equ 0EF8h
// bitfield definitions
RC6PPS_RC6PPS0_POSN                      equ 0000h
RC6PPS_RC6PPS0_POSITION                  equ 0000h
RC6PPS_RC6PPS0_SIZE                      equ 0001h
RC6PPS_RC6PPS0_LENGTH                    equ 0001h
RC6PPS_RC6PPS0_MASK                      equ 0001h
RC6PPS_RC6PPS1_POSN                      equ 0001h
RC6PPS_RC6PPS1_POSITION                  equ 0001h
RC6PPS_RC6PPS1_SIZE                      equ 0001h
RC6PPS_RC6PPS1_LENGTH                    equ 0001h
RC6PPS_RC6PPS1_MASK                      equ 0002h
RC6PPS_RC6PPS2_POSN                      equ 0002h
RC6PPS_RC6PPS2_POSITION                  equ 0002h
RC6PPS_RC6PPS2_SIZE                      equ 0001h
RC6PPS_RC6PPS2_LENGTH                    equ 0001h
RC6PPS_RC6PPS2_MASK                      equ 0004h
RC6PPS_RC6PPS3_POSN                      equ 0003h
RC6PPS_RC6PPS3_POSITION                  equ 0003h
RC6PPS_RC6PPS3_SIZE                      equ 0001h
RC6PPS_RC6PPS3_LENGTH                    equ 0001h
RC6PPS_RC6PPS3_MASK                      equ 0008h
RC6PPS_RC6PPS4_POSN                      equ 0004h
RC6PPS_RC6PPS4_POSITION                  equ 0004h
RC6PPS_RC6PPS4_SIZE                      equ 0001h
RC6PPS_RC6PPS4_LENGTH                    equ 0001h
RC6PPS_RC6PPS4_MASK                      equ 0010h

// Register: RC7PPS
#define RC7PPS RC7PPS
RC7PPS                                   equ 0EF9h
// bitfield definitions
RC7PPS_RC7PPS0_POSN                      equ 0000h
RC7PPS_RC7PPS0_POSITION                  equ 0000h
RC7PPS_RC7PPS0_SIZE                      equ 0001h
RC7PPS_RC7PPS0_LENGTH                    equ 0001h
RC7PPS_RC7PPS0_MASK                      equ 0001h
RC7PPS_RC7PPS1_POSN                      equ 0001h
RC7PPS_RC7PPS1_POSITION                  equ 0001h
RC7PPS_RC7PPS1_SIZE                      equ 0001h
RC7PPS_RC7PPS1_LENGTH                    equ 0001h
RC7PPS_RC7PPS1_MASK                      equ 0002h
RC7PPS_RC7PPS2_POSN                      equ 0002h
RC7PPS_RC7PPS2_POSITION                  equ 0002h
RC7PPS_RC7PPS2_SIZE                      equ 0001h
RC7PPS_RC7PPS2_LENGTH                    equ 0001h
RC7PPS_RC7PPS2_MASK                      equ 0004h
RC7PPS_RC7PPS3_POSN                      equ 0003h
RC7PPS_RC7PPS3_POSITION                  equ 0003h
RC7PPS_RC7PPS3_SIZE                      equ 0001h
RC7PPS_RC7PPS3_LENGTH                    equ 0001h
RC7PPS_RC7PPS3_MASK                      equ 0008h
RC7PPS_RC7PPS4_POSN                      equ 0004h
RC7PPS_RC7PPS4_POSITION                  equ 0004h
RC7PPS_RC7PPS4_SIZE                      equ 0001h
RC7PPS_RC7PPS4_LENGTH                    equ 0001h
RC7PPS_RC7PPS4_MASK                      equ 0010h

// Register: RD0PPS
#define RD0PPS RD0PPS
RD0PPS                                   equ 0EFAh
// bitfield definitions
RD0PPS_RD0PPS0_POSN                      equ 0000h
RD0PPS_RD0PPS0_POSITION                  equ 0000h
RD0PPS_RD0PPS0_SIZE                      equ 0001h
RD0PPS_RD0PPS0_LENGTH                    equ 0001h
RD0PPS_RD0PPS0_MASK                      equ 0001h
RD0PPS_RD0PPS1_POSN                      equ 0001h
RD0PPS_RD0PPS1_POSITION                  equ 0001h
RD0PPS_RD0PPS1_SIZE                      equ 0001h
RD0PPS_RD0PPS1_LENGTH                    equ 0001h
RD0PPS_RD0PPS1_MASK                      equ 0002h
RD0PPS_RD0PPS2_POSN                      equ 0002h
RD0PPS_RD0PPS2_POSITION                  equ 0002h
RD0PPS_RD0PPS2_SIZE                      equ 0001h
RD0PPS_RD0PPS2_LENGTH                    equ 0001h
RD0PPS_RD0PPS2_MASK                      equ 0004h
RD0PPS_RD0PPS3_POSN                      equ 0003h
RD0PPS_RD0PPS3_POSITION                  equ 0003h
RD0PPS_RD0PPS3_SIZE                      equ 0001h
RD0PPS_RD0PPS3_LENGTH                    equ 0001h
RD0PPS_RD0PPS3_MASK                      equ 0008h
RD0PPS_RD0PPS4_POSN                      equ 0004h
RD0PPS_RD0PPS4_POSITION                  equ 0004h
RD0PPS_RD0PPS4_SIZE                      equ 0001h
RD0PPS_RD0PPS4_LENGTH                    equ 0001h
RD0PPS_RD0PPS4_MASK                      equ 0010h

// Register: RD1PPS
#define RD1PPS RD1PPS
RD1PPS                                   equ 0EFBh
// bitfield definitions
RD1PPS_RD1PPS0_POSN                      equ 0000h
RD1PPS_RD1PPS0_POSITION                  equ 0000h
RD1PPS_RD1PPS0_SIZE                      equ 0001h
RD1PPS_RD1PPS0_LENGTH                    equ 0001h
RD1PPS_RD1PPS0_MASK                      equ 0001h
RD1PPS_RD1PPS1_POSN                      equ 0001h
RD1PPS_RD1PPS1_POSITION                  equ 0001h
RD1PPS_RD1PPS1_SIZE                      equ 0001h
RD1PPS_RD1PPS1_LENGTH                    equ 0001h
RD1PPS_RD1PPS1_MASK                      equ 0002h
RD1PPS_RD1PPS2_POSN                      equ 0002h
RD1PPS_RD1PPS2_POSITION                  equ 0002h
RD1PPS_RD1PPS2_SIZE                      equ 0001h
RD1PPS_RD1PPS2_LENGTH                    equ 0001h
RD1PPS_RD1PPS2_MASK                      equ 0004h
RD1PPS_RD1PPS3_POSN                      equ 0003h
RD1PPS_RD1PPS3_POSITION                  equ 0003h
RD1PPS_RD1PPS3_SIZE                      equ 0001h
RD1PPS_RD1PPS3_LENGTH                    equ 0001h
RD1PPS_RD1PPS3_MASK                      equ 0008h
RD1PPS_RD1PPS4_POSN                      equ 0004h
RD1PPS_RD1PPS4_POSITION                  equ 0004h
RD1PPS_RD1PPS4_SIZE                      equ 0001h
RD1PPS_RD1PPS4_LENGTH                    equ 0001h
RD1PPS_RD1PPS4_MASK                      equ 0010h

// Register: RD2PPS
#define RD2PPS RD2PPS
RD2PPS                                   equ 0EFCh
// bitfield definitions
RD2PPS_RD2PPS0_POSN                      equ 0000h
RD2PPS_RD2PPS0_POSITION                  equ 0000h
RD2PPS_RD2PPS0_SIZE                      equ 0001h
RD2PPS_RD2PPS0_LENGTH                    equ 0001h
RD2PPS_RD2PPS0_MASK                      equ 0001h
RD2PPS_RD2PPS1_POSN                      equ 0001h
RD2PPS_RD2PPS1_POSITION                  equ 0001h
RD2PPS_RD2PPS1_SIZE                      equ 0001h
RD2PPS_RD2PPS1_LENGTH                    equ 0001h
RD2PPS_RD2PPS1_MASK                      equ 0002h
RD2PPS_RD2PPS2_POSN                      equ 0002h
RD2PPS_RD2PPS2_POSITION                  equ 0002h
RD2PPS_RD2PPS2_SIZE                      equ 0001h
RD2PPS_RD2PPS2_LENGTH                    equ 0001h
RD2PPS_RD2PPS2_MASK                      equ 0004h
RD2PPS_RD2PPS3_POSN                      equ 0003h
RD2PPS_RD2PPS3_POSITION                  equ 0003h
RD2PPS_RD2PPS3_SIZE                      equ 0001h
RD2PPS_RD2PPS3_LENGTH                    equ 0001h
RD2PPS_RD2PPS3_MASK                      equ 0008h
RD2PPS_RD2PPS4_POSN                      equ 0004h
RD2PPS_RD2PPS4_POSITION                  equ 0004h
RD2PPS_RD2PPS4_SIZE                      equ 0001h
RD2PPS_RD2PPS4_LENGTH                    equ 0001h
RD2PPS_RD2PPS4_MASK                      equ 0010h

