GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
// Register: ADERRL
#define ADERRL ADERRL
ADERRL                                   equ 0F69h
// bitfield definitions
ADERRL_ADERRL_POSN                       equ 0000h
ADERRL_ADERRL_POSITION                   equ 0000h
ADERRL_ADERRL_SIZE                       equ 0008h
ADERRL_ADERRL_LENGTH                     equ 0008h
ADERRL_ADERRL_MASK                       equ 00FFh
ADERRL_ADERR0_POSN                       equ 0000h
ADERRL_ADERR0_POSITION                   equ 0000h
ADERRL_ADERR0_SIZE                       equ 0001h
ADERRL_ADERR0_LENGTH                     equ 0001h
ADERRL_ADERR0_MASK                       equ 0001h
ADERRL_ADERR1_POSN                       equ 0001h
ADERRL_ADERR1_POSITION                   equ 0001h
ADERRL_ADERR1_SIZE                       equ 0001h
ADERRL_ADERR1_LENGTH                     equ 0001h
ADERRL_ADERR1_MASK                       equ 0002h
ADERRL_ADERR2_POSN                       equ 0002h
ADERRL_ADERR2_POSITION                   equ 0002h
ADERRL_ADERR2_SIZE                       equ 0001h
ADERRL_ADERR2_LENGTH                     equ 0001h
ADERRL_ADERR2_MASK                       equ 0004h
ADERRL_ADERR3_POSN                       equ 0003h
ADERRL_ADERR3_POSITION                   equ 0003h
ADERRL_ADERR3_SIZE                       equ 0001h
ADERRL_ADERR3_LENGTH                     equ 0001h
ADERRL_ADERR3_MASK                       equ 0008h
ADERRL_ADERR4_POSN                       equ 0004h
ADERRL_ADERR4_POSITION                   equ 0004h
ADERRL_ADERR4_SIZE                       equ 0001h
ADERRL_ADERR4_LENGTH                     equ 0001h
ADERRL_ADERR4_MASK                       equ 0010h
ADERRL_ADERR5_POSN                       equ 0005h
ADERRL_ADERR5_POSITION                   equ 0005h
ADERRL_ADERR5_SIZE                       equ 0001h
ADERRL_ADERR5_LENGTH                     equ 0001h
ADERRL_ADERR5_MASK                       equ 0020h
ADERRL_ADERR6_POSN                       equ 0006h
ADERRL_ADERR6_POSITION                   equ 0006h
ADERRL_ADERR6_SIZE                       equ 0001h
ADERRL_ADERR6_LENGTH                     equ 0001h
ADERRL_ADERR6_MASK                       equ 0040h
ADERRL_ADERR7_POSN                       equ 0007h
ADERRL_ADERR7_POSITION                   equ 0007h
ADERRL_ADERR7_SIZE                       equ 0001h
ADERRL_ADERR7_LENGTH                     equ 0001h
ADERRL_ADERR7_MASK                       equ 0080h

// Register: ADERRH
#define ADERRH ADERRH
ADERRH                                   equ 0F6Ah
// bitfield definitions
ADERRH_ADERRH_POSN                       equ 0000h
ADERRH_ADERRH_POSITION                   equ 0000h
ADERRH_ADERRH_SIZE                       equ 0008h
ADERRH_ADERRH_LENGTH                     equ 0008h
ADERRH_ADERRH_MASK                       equ 00FFh
ADERRH_ADERR8_POSN                       equ 0000h
ADERRH_ADERR8_POSITION                   equ 0000h
ADERRH_ADERR8_SIZE                       equ 0001h
ADERRH_ADERR8_LENGTH                     equ 0001h
ADERRH_ADERR8_MASK                       equ 0001h
ADERRH_ADERR9_POSN                       equ 0001h
ADERRH_ADERR9_POSITION                   equ 0001h
ADERRH_ADERR9_SIZE                       equ 0001h
ADERRH_ADERR9_LENGTH                     equ 0001h
ADERRH_ADERR9_MASK                       equ 0002h
ADERRH_ADERR10_POSN                      equ 0002h
ADERRH_ADERR10_POSITION                  equ 0002h
ADERRH_ADERR10_SIZE                      equ 0001h
ADERRH_ADERR10_LENGTH                    equ 0001h
ADERRH_ADERR10_MASK                      equ 0004h
ADERRH_ADERR11_POSN                      equ 0003h
ADERRH_ADERR11_POSITION                  equ 0003h
ADERRH_ADERR11_SIZE                      equ 0001h
ADERRH_ADERR11_LENGTH                    equ 0001h
ADERRH_ADERR11_MASK                      equ 0008h
ADERRH_ADERR12_POSN                      equ 0004h
ADERRH_ADERR12_POSITION                  equ 0004h
ADERRH_ADERR12_SIZE                      equ 0001h
ADERRH_ADERR12_LENGTH                    equ 0001h
ADERRH_ADERR12_MASK                      equ 0010h
ADERRH_ADERR13_POSN                      equ 0005h
ADERRH_ADERR13_POSITION                  equ 0005h
ADERRH_ADERR13_SIZE                      equ 0001h
ADERRH_ADERR13_LENGTH                    equ 0001h
ADERRH_ADERR13_MASK                      equ 0020h
ADERRH_ADERR14_POSN                      equ 0006h
ADERRH_ADERR14_POSITION                  equ 0006h
ADERRH_ADERR14_SIZE                      equ 0001h
ADERRH_ADERR14_LENGTH                    equ 0001h
ADERRH_ADERR14_MASK                      equ 0040h
ADERRH_ADERR15_POSN                      equ 0007h
ADERRH_ADERR15_POSITION                  equ 0007h
ADERRH_ADERR15_SIZE                      equ 0001h
ADERRH_ADERR15_LENGTH                    equ 0001h
ADERRH_ADERR15_MASK                      equ 0080h

// Register: ADACC
#define ADACC ADACC
ADACC                                    equ 0F6Bh

// Register: ADACCL
#define ADACCL ADACCL
ADACCL                                   equ 0F6Bh
// bitfield definitions
ADACCL_ADACCL_POSN                       equ 0000h
ADACCL_ADACCL_POSITION                   equ 0000h
ADACCL_ADACCL_SIZE                       equ 0008h
ADACCL_ADACCL_LENGTH                     equ 0008h
ADACCL_ADACCL_MASK                       equ 00FFh
ADACCL_ADACC0_POSN                       equ 0000h
ADACCL_ADACC0_POSITION                   equ 0000h
ADACCL_ADACC0_SIZE                       equ 0001h
ADACCL_ADACC0_LENGTH                     equ 0001h
ADACCL_ADACC0_MASK                       equ 0001h
ADACCL_ADACC1_POSN                       equ 0001h
ADACCL_ADACC1_POSITION                   equ 0001h
ADACCL_ADACC1_SIZE                       equ 0001h
ADACCL_ADACC1_LENGTH                     equ 0001h
ADACCL_ADACC1_MASK                       equ 0002h
ADACCL_ADACC2_POSN                       equ 0002h
ADACCL_ADACC2_POSITION                   equ 0002h
ADACCL_ADACC2_SIZE                       equ 0001h
ADACCL_ADACC2_LENGTH                     equ 0001h
ADACCL_ADACC2_MASK                       equ 0004h
ADACCL_ADACC3_POSN                       equ 0003h
ADACCL_ADACC3_POSITION                   equ 0003h
ADACCL_ADACC3_SIZE                       equ 0001h
ADACCL_ADACC3_LENGTH                     equ 0001h
ADACCL_ADACC3_MASK                       equ 0008h
ADACCL_ADACC4_POSN                       equ 0004h
ADACCL_ADACC4_POSITION                   equ 0004h
ADACCL_ADACC4_SIZE                       equ 0001h
ADACCL_ADACC4_LENGTH                     equ 0001h
ADACCL_ADACC4_MASK                       equ 0010h
ADACCL_ADACC5_POSN                       equ 0005h
ADACCL_ADACC5_POSITION                   equ 0005h
ADACCL_ADACC5_SIZE                       equ 0001h
ADACCL_ADACC5_LENGTH                     equ 0001h
ADACCL_ADACC5_MASK                       equ 0020h
ADACCL_ADACC6_POSN                       equ 0006h
ADACCL_ADACC6_POSITION                   equ 0006h
ADACCL_ADACC6_SIZE                       equ 0001h
ADACCL_ADACC6_LENGTH                     equ 0001h
ADACCL_ADACC6_MASK                       equ 0040h
ADACCL_ADACC7_POSN                       equ 0007h
ADACCL_ADACC7_POSITION                   equ 0007h
ADACCL_ADACC7_SIZE                       equ 0001h
ADACCL_ADACC7_LENGTH                     equ 0001h
ADACCL_ADACC7_MASK                       equ 0080h

// Register: ADACCH
#define ADACCH ADACCH
ADACCH                                   equ 0F6Ch
// bitfield definitions
ADACCH_ADACCH_POSN                       equ 0000h
ADACCH_ADACCH_POSITION                   equ 0000h
ADACCH_ADACCH_SIZE                       equ 0008h
ADACCH_ADACCH_LENGTH                     equ 0008h
ADACCH_ADACCH_MASK                       equ 00FFh
ADACCH_ADACC8_POSN                       equ 0000h
ADACCH_ADACC8_POSITION                   equ 0000h
ADACCH_ADACC8_SIZE                       equ 0001h
ADACCH_ADACC8_LENGTH                     equ 0001h
ADACCH_ADACC8_MASK                       equ 0001h
ADACCH_ADACC9_POSN                       equ 0001h
ADACCH_ADACC9_POSITION                   equ 0001h
ADACCH_ADACC9_SIZE                       equ 0001h
ADACCH_ADACC9_LENGTH                     equ 0001h
ADACCH_ADACC9_MASK                       equ 0002h
ADACCH_ADACC10_POSN                      equ 0002h
ADACCH_ADACC10_POSITION                  equ 0002h
ADACCH_ADACC10_SIZE                      equ 0001h
ADACCH_ADACC10_LENGTH                    equ 0001h
ADACCH_ADACC10_MASK                      equ 0004h
ADACCH_ADACC11_POSN                      equ 0003h
ADACCH_ADACC11_POSITION                  equ 0003h
ADACCH_ADACC11_SIZE                      equ 0001h
ADACCH_ADACC11_LENGTH                    equ 0001h
ADACCH_ADACC11_MASK                      equ 0008h
ADACCH_ADACC12_POSN                      equ 0004h
ADACCH_ADACC12_POSITION                  equ 0004h
ADACCH_ADACC12_SIZE                      equ 0001h
ADACCH_ADACC12_LENGTH                    equ 0001h
ADACCH_ADACC12_MASK                      equ 0010h
ADACCH_ADACC13_POSN                      equ 0005h
ADACCH_ADACC13_POSITION                  equ 0005h
ADACCH_ADACC13_SIZE                      equ 0001h
ADACCH_ADACC13_LENGTH                    equ 0001h
ADACCH_ADACC13_MASK                      equ 0020h
ADACCH_ADACC14_POSN                      equ 0006h
ADACCH_ADACC14_POSITION                  equ 0006h
ADACCH_ADACC14_SIZE                      equ 0001h
ADACCH_ADACC14_LENGTH                    equ 0001h
ADACCH_ADACC14_MASK                      equ 0040h
ADACCH_ADACC15_POSN                      equ 0007h
ADACCH_ADACC15_POSITION                  equ 0007h
ADACCH_ADACC15_SIZE                      equ 0001h
ADACCH_ADACC15_LENGTH                    equ 0001h
ADACCH_ADACC15_MASK                      equ 0080h

// Register: ADFLTR
#define ADFLTR ADFLTR
ADFLTR                                   equ 0F6Dh

