GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
#define ANSELC3                          BANKMASK(ANSELC), 3, b
#define ANSELC4                          BANKMASK(ANSELC), 4, b
#define ANSELC5                          BANKMASK(ANSELC), 5, b
#define ANSELC6                          BANKMASK(ANSELC), 6, b
#define ANSELC7                          BANKMASK(ANSELC), 7, b
#define ANSELD0                          BANKMASK(ANSELD), 0, b
#define ANSELD1                          BANKMASK(ANSELD), 1, b
#define ANSELD2                          BANKMASK(ANSELD), 2, b
#define ANSELD3                          BANKMASK(ANSELD), 3, b
#define ANSELD4                          BANKMASK(ANSELD), 4, b
#define ANSELD5                          BANKMASK(ANSELD), 5, b
#define ANSELD6                          BANKMASK(ANSELD), 6, b
#define ANSELD7                          BANKMASK(ANSELD), 7, b
#define ANSELE0                          BANKMASK(ANSELE), 0, b
#define ANSELE1                          BANKMASK(ANSELE), 1, b
#define ANSELE2                          BANKMASK(ANSELE), 2, b
#define AS0E                             BANKMASK(CWG1AS1), 0, b
#define AS1E                             BANKMASK(CWG1AS1), 1, b
#define AS2E                             BANKMASK(CWG1AS1), 2, b
#define AS3E                             BANKMASK(CWG1AS1), 3, b
#define AS4E                             BANKMASK(CWG1AS1), 4, b
#define AS5E                             BANKMASK(CWG1AS1), 5, b
#define BCL1IE                           BANKMASK(PIE3), 1, b
#define BCL1IF                           BANKMASK(PIR3), 1, b
#define BCL1IP                           BANKMASK(IPR3), 1, b
#define BCL2IE                           BANKMASK(PIE3), 3, b
#define BCL2IF                           BANKMASK(PIR3), 3, b
#define BCL2IP                           BANKMASK(IPR3), 3, b
#define BCLIE                            BANKMASK(PIE3), 1, b
#define BCLIF                            BANKMASK(PIR3), 1, b
#define BCLIP                            BANKMASK(IPR3), 1, b
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1IE                             BANKMASK(PIE2), 0, b
#define C1IF                             BANKMASK(PIR2), 0, b
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR2), 0, b
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1OUT                            BANKMASK(CM1CON0), 6, b
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS), 0, a
#define C1TSEL1                          BANKMASK(CCPTMRS), 1, a
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2IE                             BANKMASK(PIE2), 1, b
#define C2IF                             BANKMASK(PIR2), 1, b
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR2), 1, b
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2OUT                            BANKMASK(CM2CON0), 6, b
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define C2TSEL0                          BANKMASK(CCPTMRS), 2, a
#define C2TSEL1                          BANKMASK(CCPTMRS), 3, a
#define CAL01                            BANKMASK(TMR1L), 0, a
#define CAL03                            BANKMASK(TMR3L), 0, a
#define CAL05                            BANKMASK(TMR5L), 0, a
#define CAL11                            BANKMASK(TMR1L), 1, a
#define CAL13                            BANKMASK(TMR3L), 1, a
#define CAL15                            BANKMASK(TMR5L), 1, a
#define CAL21                            BANKMASK(TMR1L), 2, a
#define CAL23                            BANKMASK(TMR3L), 2, a
#define CAL25                            BANKMASK(TMR5L), 2, a
#define CAL31                            BANKMASK(TMR1L), 3, a
#define CAL33                            BANKMASK(TMR3L), 3, a
#define CAL35                            BANKMASK(TMR5L), 3, a
#define CAL41                            BANKMASK(TMR1L), 4, a
#define CAL43                            BANKMASK(TMR3L), 4, a
#define CAL45                            BANKMASK(TMR5L), 4, a
#define CAL51                            BANKMASK(TMR1L), 5, a
#define CAL53                            BANKMASK(TMR3L), 5, a
#define CAL55                            BANKMASK(TMR5L), 5, a
#define CAL61                            BANKMASK(TMR1L), 6, a
#define CAL63                            BANKMASK(TMR3L), 6, a
#define CAL65                            BANKMASK(TMR5L), 6, a
#define CAL71                            BANKMASK(TMR1L), 7, a
#define CAL73                            BANKMASK(TMR3L), 7, a
#define CAL75                            BANKMASK(TMR5L), 7, a
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, a
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, a
#define CCP1EN                           BANKMASK(CCP1CON), 7, a
#define CCP1FMT                          BANKMASK(CCP1CON), 4, a
#define CCP1IE                           BANKMASK(PIE6), 0, b
#define CCP1IF                           BANKMASK(PIR6), 0, b
#define CCP1IP                           BANKMASK(IPR6), 0, b
#define CCP1MD                           BANKMASK(PMD3), 0, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, a
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, a
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, a
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, a
#define CCP1OUT                          BANKMASK(CCP1CON), 5, a
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0, b
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1, b
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2, b
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3, b
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4, b
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, a
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, a
#define CCP2EN                           BANKMASK(CCP2CON), 7, a
#define CCP2FMT                          BANKMASK(CCP2CON), 4, a
#define CCP2IE                           BANKMASK(PIE6), 1, b
#define CCP2IF                           BANKMASK(PIR6), 1, b
#define CCP2IP                           BANKMASK(IPR6), 1, b
#define CCP2MD                           BANKMASK(PMD3), 1, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, a
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, a
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, a
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, a
#define CCP2OUT                          BANKMASK(CCP2CON), 5, a
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0, b
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1, b
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2, b
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3, b
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4, b
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CHPOL                            BANKMASK(MDCON1), 5, b
#define CHS0                             BANKMASK(MDCARH), 0, b
#define CHS1                             BANKMASK(MDCARH), 1, b
#define CHS2                             BANKMASK(MDCARH), 2, b
#define CHSYNC                           BANKMASK(MDCON1), 4, b
#define CK2PPS0                          BANKMASK(CK2PPS), 0, b
#define CK2PPS1                          BANKMASK(CK2PPS), 1, b
#define CK2PPS2                          BANKMASK(CK2PPS), 2, b
#define CK2PPS3                          BANKMASK(CK2PPS), 3, b
#define CK2PPS4                          BANKMASK(CK2PPS), 4, b
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, b
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, b
#define CLC1IE                           BANKMASK(PIE5), 4, b
#define CLC1IF                           BANKMASK(PIR5), 4, b
#define CLC1IP                           BANKMASK(IPR5), 4, b
#define CLC1MD                           BANKMASK(PMD5), 4, b
#define CLC2IE                           BANKMASK(PIE5), 5, b
#define CLC2IF                           BANKMASK(PIR5), 5, b
#define CLC2IP                           BANKMASK(IPR5), 5, b
#define CLC2MD                           BANKMASK(PMD5), 5, b
#define CLC3IE                           BANKMASK(PIE5), 6, b
#define CLC3IF                           BANKMASK(PIR5), 6, b
#define CLC3IP                           BANKMASK(IPR5), 6, b
#define CLC3MD                           BANKMASK(PMD5), 6, b
#define CLC4IE                           BANKMASK(PIE5), 7, b
#define CLC4IF                           BANKMASK(PIR5), 7, b
#define CLC4IP                           BANKMASK(IPR5), 7, b
#define CLC4MD                           BANKMASK(PMD5), 7, b
#define CLC5IE                           BANKMASK(PIE6), 4, b
#define CLC5IF                           BANKMASK(PIR6), 4, b
#define CLC5IP                           BANKMASK(IPR6), 4, b
#define CLC5MD                           BANKMASK(PMD3), 4, b
#define CLC6IE                           BANKMASK(PIE6), 5, b
#define CLC6IF                           BANKMASK(PIR6), 5, b
#define CLC6IP                           BANKMASK(IPR6), 5, b
#define CLC6MD                           BANKMASK(PMD3), 5, b
#define CLC7IE                           BANKMASK(PIE6), 6, b
#define CLC7IF                           BANKMASK(PIR6), 6, b
#define CLC7IP                           BANKMASK(IPR6), 6, b
#define CLC7MD                           BANKMASK(PMD3), 6, b
#define CLC8IE                           BANKMASK(PIE6), 7, b
#define CLC8IF                           BANKMASK(PIR6), 7, b
#define CLC8IP                           BANKMASK(IPR6), 7, b
#define CLC8MD                           BANKMASK(PMD3), 7, b
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0, b
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1, b
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2, b
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3, b
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4, b
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0, b
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1, b
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2, b
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3, b
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4, b
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0, b
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1, b
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2, b
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3, b
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4, b
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0, b
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1, b
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2, b
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3, b
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4, b
#define CLCIN4PPS0                       BANKMASK(CLCIN4PPS), 0, b
#define CLCIN4PPS1                       BANKMASK(CLCIN4PPS), 1, b
#define CLCIN4PPS2                       BANKMASK(CLCIN4PPS), 2, b
#define CLCIN4PPS3                       BANKMASK(CLCIN4PPS), 3, b
#define CLCIN4PPS4                       BANKMASK(CLCIN4PPS), 4, b
#define CLCIN5PPS0                       BANKMASK(CLCIN5PPS), 0, b
#define CLCIN5PPS1                       BANKMASK(CLCIN5PPS), 1, b
#define CLCIN5PPS2                       BANKMASK(CLCIN5PPS), 2, b
#define CLCIN5PPS3                       BANKMASK(CLCIN5PPS), 3, b
#define CLCIN5PPS4                       BANKMASK(CLCIN5PPS), 4, b
#define CLCIN6PPS0                       BANKMASK(CLCIN6PPS), 0, b
#define CLCIN6PPS1                       BANKMASK(CLCIN6PPS), 1, b
#define CLCIN6PPS2                       BANKMASK(CLCIN6PPS), 2, b
#define CLCIN6PPS3                       BANKMASK(CLCIN6PPS), 3, b
#define CLCIN6PPS4                       BANKMASK(CLCIN6PPS), 4, b
#define CLCIN7PPS0                       BANKMASK(CLCIN7PPS), 0, b
#define CLCIN7PPS1                       BANKMASK(CLCIN7PPS), 1, b
#define CLCIN7PPS2                       BANKMASK(CLCIN7PPS), 2, b
#define CLCIN7PPS3                       BANKMASK(CLCIN7PPS), 3, b
#define CLCIN7PPS4                       BANKMASK(CLCIN7PPS), 4, b
#define CLK0                             BANKMASK(CLKRCLK), 0, b
#define CLK1                             BANKMASK(CLKRCLK), 1, b
#define CLK2                             BANKMASK(CLKRCLK), 2, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CLPOL                            BANKMASK(MDCON1), 1, b
#define CLS0                             BANKMASK(MDCARL), 0, b
#define CLS1                             BANKMASK(MDCARL), 1, b
#define CLS2                             BANKMASK(MDCARL), 2, b
#define CLSYNC                           BANKMASK(MDCON1), 0, b
#define CMP1MD                           BANKMASK(PMD2), 1, b
#define CMP2MD                           BANKMASK(PMD2), 2, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CRCEN                            BANKMASK(CRCCON0), 7, a
#define CRCGO                            BANKMASK(CRCCON0), 6, a
#define CRCIE                            BANKMASK(PIE7), 6, b
#define CRCIF                            BANKMASK(PIR7), 6, b
#define CRCIP                            BANKMASK(IPR7), 6, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CS                               BANKMASK(CWG1CLK), 0, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE1), 6, b
#define CSWIF                            BANKMASK(PIR1), 6, b
#define CSWIP                            BANKMASK(IPR1), 6, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE7), 0, b
#define CWG1IF                           BANKMASK(PIR7), 0, b
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1INPPS0                       BANKMASK(CWG1PPS), 0, b
#define CWG1INPPS1                       BANKMASK(CWG1PPS), 1, b
#define CWG1INPPS2                       BANKMASK(CWG1PPS), 2, b
#define CWG1INPPS3                       BANKMASK(CWG1PPS), 3, b
#define CWG1INPPS4                       BANKMASK(CWG1PPS), 4, b
#define CWG1IP                           BANKMASK(IPR7), 0, b
#define CWG1ISM0                         BANKMASK(CWG1ISM), 0, b
#define CWG1ISM1                         BANKMASK(CWG1ISM), 1, b
#define CWG1ISM2                         BANKMASK(CWG1ISM), 2, b
#define CWG1ISM3                         BANKMASK(CWG1ISM), 3, b
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD4), 0, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1REN                          BANKMASK(CWG1AS0), 6, b
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWGIE                            BANKMASK(PIE7), 0, b
#define CWGIF                            BANKMASK(PIR7), 0, b
#define CWGINPPS0                        BANKMASK(CWG1PPS), 0, b
#define CWGINPPS1                        BANKMASK(CWG1PPS), 1, b
#define CWGINPPS2                        BANKMASK(CWG1PPS), 2, b
#define CWGINPPS3                        BANKMASK(CWG1PPS), 3, b
#define CWGINPPS4                        BANKMASK(CWG1PPS), 4, b
#define CWGIP                            BANKMASK(IPR7), 0, b
#define CWGMD                            BANKMASK(PMD4), 0, b
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, b
#define DABORT                           BANKMASK(SCANCON0), 4, b
#define DAC1EN                           BANKMASK(DAC1CON0), 7, b
#define DAC1NSS                          BANKMASK(DAC1CON0), 0, b
#define DAC1OE1                          BANKMASK(DAC1CON0), 5, b
#define DAC1OE2                          BANKMASK(DAC1CON0), 4, b
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3, b
#define DAC1R0                           BANKMASK(DAC1CON1), 0, b
#define DAC1R1                           BANKMASK(DAC1CON1), 1, b
#define DAC1R2                           BANKMASK(DAC1CON1), 2, b
#define DAC1R3                           BANKMASK(DAC1CON1), 3, b
#define DAC1R4                           BANKMASK(DAC1CON1), 4, b
#define DACMD                            BANKMASK(PMD2), 6, b
#define DATA0                            BANKMASK(CRCDATL), 0, a
#define DATA1                            BANKMASK(CRCDATL), 1, a
#define DATA10                           BANKMASK(CRCDATH), 2, a
#define DATA11                           BANKMASK(CRCDATH), 3, a
#define DATA12                           BANKMASK(CRCDATH), 4, a
#define DATA13                           BANKMASK(CRCDATH), 5, a
#define DATA14                           BANKMASK(CRCDATH), 6, a
#define DATA15                           BANKMASK(CRCDATH), 7, a
#define DATA2                            BANKMASK(CRCDATL), 2, a
#define DATA3                            BANKMASK(CRCDATL), 3, a
#define DATA4                            BANKMASK(CRCDATL), 4, a
#define DATA5                            BANKMASK(CRCDATL), 5, a
#define DATA6                            BANKMASK(CRCDATL), 6, a
#define DATA7                            BANKMASK(CRCDATL), 7, a
#define DATA8                            BANKMASK(CRCDATH), 0, a
#define DATA9                            BANKMASK(CRCDATH), 1, a
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5, a
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, b
#define DBF0                             BANKMASK(CWG1DBF), 0, b
#define DBF1                             BANKMASK(CWG1DBF), 1, b
#define DBF2                             BANKMASK(CWG1DBF), 2, b
#define DBF3                             BANKMASK(CWG1DBF), 3, b
#define DBF4                             BANKMASK(CWG1DBF), 4, b
#define DBF5                             BANKMASK(CWG1DBF), 5, b
#define DBR0                             BANKMASK(CWG1DBR), 0, b
#define DBR1                             BANKMASK(CWG1DBR), 1, b
#define DBR2                             BANKMASK(CWG1DBR), 2, b
#define DBR3                             BANKMASK(CWG1DBR), 3, b
#define DBR4                             BANKMASK(CWG1DBR), 4, b
#define DBR5                             BANKMASK(CWG1DBR), 5, b
#define DC                               BANKMASK(STATUS), 1, a
#define DIV0                             BANKMASK(CLKRCON), 0, b
#define DIV1                             BANKMASK(CLKRCON), 1, b
#define DIV2                             BANKMASK(CLKRCON), 2, b
#define DLEN0                            BANKMASK(CRCCON1), 4, a
#define DLEN1                            BANKMASK(CRCCON1), 5, a
#define DLEN2                            BANKMASK(CRCCON1), 6, a
#define DLEN3                            BANKMASK(CRCCON1), 7, a
#define DOE                              BANKMASK(CPUDOZE), 4, b
#define DONE                             BANKMASK(ADCON0), 0, b
#define DOZE0                            BANKMASK(CPUDOZE), 0, b
