GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
#define DOZE1                            BANKMASK(CPUDOZE), 1, b
#define DOZE2                            BANKMASK(CPUDOZE), 2, b
#define DOZEN                            BANKMASK(CPUDOZE), 6, b
#define DSMMD                            BANKMASK(PMD5), 0, b
#define D_A1                             BANKMASK(SSP1STAT), 5, a
#define D_A2                             BANKMASK(SSP2STAT), 5, b
#define D_NOT_A1                         BANKMASK(SSP1STAT), 5, a
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, b
#define D_nA1                            BANKMASK(SSP1STAT), 5, a
#define D_nA2                            BANKMASK(SSP2STAT), 5, b
#define EMBMD                            BANKMASK(PMD1), 0, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FULL                             BANKMASK(CRCCON0), 0, a
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GCEN2                            BANKMASK(SSP2CON2), 7, b
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 0, b
#define GO_nDONE                         BANKMASK(ADCON0), 0, b
#define HADR0                            BANKMASK(SCANHADRL), 0, b
#define HADR1                            BANKMASK(SCANHADRL), 1, b
#define HADR10                           BANKMASK(SCANHADRH), 2, b
#define HADR11                           BANKMASK(SCANHADRH), 3, b
#define HADR12                           BANKMASK(SCANHADRH), 4, b
#define HADR13                           BANKMASK(SCANHADRH), 5, b
#define HADR14                           BANKMASK(SCANHADRH), 6, b
#define HADR15                           BANKMASK(SCANHADRH), 7, b
#define HADR16                           BANKMASK(SCANHADRU), 0, b
#define HADR17                           BANKMASK(SCANHADRU), 1, b
#define HADR18                           BANKMASK(SCANHADRU), 2, b
#define HADR19                           BANKMASK(SCANHADRU), 3, b
#define HADR2                            BANKMASK(SCANHADRL), 2, b
#define HADR20                           BANKMASK(SCANHADRU), 4, b
#define HADR21                           BANKMASK(SCANHADRU), 5, b
#define HADR3                            BANKMASK(SCANHADRL), 3, b
#define HADR4                            BANKMASK(SCANHADRL), 4, b
#define HADR5                            BANKMASK(SCANHADRL), 5, b
#define HADR6                            BANKMASK(SCANHADRL), 6, b
#define HADR7                            BANKMASK(SCANHADRL), 7, b
#define HADR8                            BANKMASK(SCANHADRH), 0, b
#define HADR9                            BANKMASK(SCANHADRH), 1, b
#define HFOEN                            BANKMASK(OSCEN), 6, b
#define HFOR                             BANKMASK(OSCSTAT), 6, b
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE2), 7, b
#define HLVDIF                           BANKMASK(PIR2), 7, b
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
#define HLVDINTL                         BANKMASK(HLVDCON0), 0, b
#define HLVDIP                           BANKMASK(IPR2), 7, b
#define HLVDMD                           BANKMASK(PMD0), 5, b
#define HLVDOUT                          BANKMASK(HLVDCON0), 5, b
#define HLVDRDY                          BANKMASK(HLVDCON0), 4, b
#define HLVDSEL0                         BANKMASK(HLVDCON1), 0, b
#define HLVDSEL1                         BANKMASK(HLVDCON1), 1, b
#define HLVDSEL2                         BANKMASK(HLVDCON1), 2, b
#define HLVDSEL3                         BANKMASK(HLVDCON1), 3, b
#define I2C_DAT1                         BANKMASK(SSP1STAT), 5, a
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, b
#define I2C_READ1                        BANKMASK(SSP1STAT), 2, a
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, b
#define I2C_START1                       BANKMASK(SSP1STAT), 3, a
#define I2C_START2                       BANKMASK(SSP2STAT), 3, b
#define IDLEN                            BANKMASK(CPUDOZE), 7, b
#define IN                               BANKMASK(CWG1CON1), 5, b
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLC7                          BANKMASK(INLVLC), 7, b
#define INLVLD0                          BANKMASK(INLVLD), 0, b
#define INLVLD1                          BANKMASK(INLVLD), 1, b
#define INLVLD2                          BANKMASK(INLVLD), 2, b
#define INLVLD3                          BANKMASK(INLVLD), 3, b
#define INLVLD4                          BANKMASK(INLVLD), 4, b
#define INLVLD5                          BANKMASK(INLVLD), 5, b
#define INLVLD6                          BANKMASK(INLVLD), 6, b
#define INLVLD7                          BANKMASK(INLVLD), 7, b
#define INLVLE0                          BANKMASK(INLVLE), 0, b
#define INLVLE1                          BANKMASK(INLVLE), 1, b
#define INLVLE2                          BANKMASK(INLVLE), 2, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INT0EDG                          BANKMASK(INTCON), 0, a
#define INT0IE                           BANKMASK(PIE0), 0, b
#define INT0IF                           BANKMASK(PIR0), 0, b
#define INT0IP                           BANKMASK(IPR0), 0, b
#define INT0PPS0                         BANKMASK(INT0PPS), 0, b
#define INT0PPS1                         BANKMASK(INT0PPS), 1, b
#define INT0PPS2                         BANKMASK(INT0PPS), 2, b
#define INT0PPS3                         BANKMASK(INT0PPS), 3, b
#define INT1EDG                          BANKMASK(INTCON), 1, a
#define INT1IE                           BANKMASK(PIE0), 1, b
#define INT1IF                           BANKMASK(PIR0), 1, b
#define INT1IP                           BANKMASK(IPR0), 1, b
#define INT1PPS0                         BANKMASK(INT1PPS), 0, b
#define INT1PPS1                         BANKMASK(INT1PPS), 1, b
#define INT1PPS2                         BANKMASK(INT1PPS), 2, b
#define INT1PPS3                         BANKMASK(INT1PPS), 3, b
#define INT2EDG                          BANKMASK(INTCON), 2, a
#define INT2IE                           BANKMASK(PIE0), 2, b
#define INT2IF                           BANKMASK(PIR0), 2, b
#define INT2IP                           BANKMASK(IPR0), 2, b
#define INT2PPS0                         BANKMASK(INT2PPS), 0, b
#define INT2PPS1                         BANKMASK(INT2PPS), 1, b
#define INT2PPS2                         BANKMASK(INT2PPS), 2, b
#define INT2PPS3                         BANKMASK(INT2PPS), 3, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define INTM                             BANKMASK(SCANCON0), 3, b
#define INVALID                          BANKMASK(SCANCON0), 4, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAF6                           BANKMASK(IOCAF), 6, b
#define IOCAF7                           BANKMASK(IOCAF), 7, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAN6                           BANKMASK(IOCAN), 6, b
#define IOCAN7                           BANKMASK(IOCAN), 7, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCAP6                           BANKMASK(IOCAP), 6, b
#define IOCAP7                           BANKMASK(IOCAP), 7, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
#define IOCBN7                           BANKMASK(IOCBN), 7, b
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCN7                           BANKMASK(IOCCN), 7, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP2                           BANKMASK(IOCCP), 2, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCIE                            BANKMASK(PIE0), 4, b
#define IOCIF                            BANKMASK(PIR0), 4, b
#define IOCIP                            BANKMASK(IPR0), 4, b
#define IOCMD                            BANKMASK(PMD0), 0, b
#define IPEN                             BANKMASK(INTCON), 5, a
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LC1D1S0                          BANKMASK(CLC1SEL0), 0, b
#define LC1D1S1                          BANKMASK(CLC1SEL0), 1, b
#define LC1D1S2                          BANKMASK(CLC1SEL0), 2, b
#define LC1D1S3                          BANKMASK(CLC1SEL0), 3, b
#define LC1D1S4                          BANKMASK(CLC1SEL0), 4, b
#define LC1D1S5                          BANKMASK(CLC1SEL0), 5, b
#define LC1D1S6                          BANKMASK(CLC1SEL0), 6, b
#define LC1D1S7                          BANKMASK(CLC1SEL0), 7, b
#define LC1D2S0                          BANKMASK(CLC1SEL1), 0, b
#define LC1D2S1                          BANKMASK(CLC1SEL1), 1, b
#define LC1D2S2                          BANKMASK(CLC1SEL1), 2, b
#define LC1D2S3                          BANKMASK(CLC1SEL1), 3, b
#define LC1D2S4                          BANKMASK(CLC1SEL1), 4, b
#define LC1D2S5                          BANKMASK(CLC1SEL1), 5, b
#define LC1D2S6                          BANKMASK(CLC1SEL1), 6, b
#define LC1D2S7                          BANKMASK(CLC1SEL1), 7, b
#define LC1D3S0                          BANKMASK(CLC1SEL2), 0, b
#define LC1D3S1                          BANKMASK(CLC1SEL2), 1, b
#define LC1D3S2                          BANKMASK(CLC1SEL2), 2, b
#define LC1D3S3                          BANKMASK(CLC1SEL2), 3, b
#define LC1D3S4                          BANKMASK(CLC1SEL2), 4, b
#define LC1D3S5                          BANKMASK(CLC1SEL2), 5, b
#define LC1D3S6                          BANKMASK(CLC1SEL2), 6, b
#define LC1D3S7                          BANKMASK(CLC1SEL2), 7, b
#define LC1D4S0                          BANKMASK(CLC1SEL3), 0, b
#define LC1D4S1                          BANKMASK(CLC1SEL3), 1, b
#define LC1D4S2                          BANKMASK(CLC1SEL3), 2, b
#define LC1D4S3                          BANKMASK(CLC1SEL3), 3, b
#define LC1D4S4                          BANKMASK(CLC1SEL3), 4, b
#define LC1D4S5                          BANKMASK(CLC1SEL3), 5, b
#define LC1D4S6                          BANKMASK(CLC1SEL3), 6, b
#define LC1D4S7                          BANKMASK(CLC1SEL3), 7, b
#define LC1EN                            BANKMASK(CLC1CON), 7, b
#define LC1G1D1N                         BANKMASK(CLC1GLS0), 0, b
#define LC1G1D1T                         BANKMASK(CLC1GLS0), 1, b
#define LC1G1D2N                         BANKMASK(CLC1GLS0), 2, b
#define LC1G1D2T                         BANKMASK(CLC1GLS0), 3, b
#define LC1G1D3N                         BANKMASK(CLC1GLS0), 4, b
#define LC1G1D3T                         BANKMASK(CLC1GLS0), 5, b
#define LC1G1D4N                         BANKMASK(CLC1GLS0), 6, b
#define LC1G1D4T                         BANKMASK(CLC1GLS0), 7, b
#define LC1G1POL                         BANKMASK(CLC1POL), 0, b
#define LC1G2D1N                         BANKMASK(CLC1GLS1), 0, b
#define LC1G2D1T                         BANKMASK(CLC1GLS1), 1, b
#define LC1G2D2N                         BANKMASK(CLC1GLS1), 2, b
#define LC1G2D2T                         BANKMASK(CLC1GLS1), 3, b
#define LC1G2D3N                         BANKMASK(CLC1GLS1), 4, b
#define LC1G2D3T                         BANKMASK(CLC1GLS1), 5, b
#define LC1G2D4N                         BANKMASK(CLC1GLS1), 6, b
#define LC1G2D4T                         BANKMASK(CLC1GLS1), 7, b
#define LC1G2POL                         BANKMASK(CLC1POL), 1, b
#define LC1G3D1N                         BANKMASK(CLC1GLS2), 0, b
#define LC1G3D1T                         BANKMASK(CLC1GLS2), 1, b
#define LC1G3D2N                         BANKMASK(CLC1GLS2), 2, b
#define LC1G3D2T                         BANKMASK(CLC1GLS2), 3, b
#define LC1G3D3N                         BANKMASK(CLC1GLS2), 4, b
#define LC1G3D3T                         BANKMASK(CLC1GLS2), 5, b
#define LC1G3D4N                         BANKMASK(CLC1GLS2), 6, b
#define LC1G3D4T                         BANKMASK(CLC1GLS2), 7, b
#define LC1G3POL                         BANKMASK(CLC1POL), 2, b
#define LC1G4D1N                         BANKMASK(CLC1GLS3), 0, b
#define LC1G4D1T                         BANKMASK(CLC1GLS3), 1, b
#define LC1G4D2N                         BANKMASK(CLC1GLS3), 2, b
#define LC1G4D2T                         BANKMASK(CLC1GLS3), 3, b
#define LC1G4D3N                         BANKMASK(CLC1GLS3), 4, b
#define LC1G4D3T                         BANKMASK(CLC1GLS3), 5, b
#define LC1G4D4N                         BANKMASK(CLC1GLS3), 6, b
#define LC1G4D4T                         BANKMASK(CLC1GLS3), 7, b
#define LC1G4POL                         BANKMASK(CLC1POL), 3, b
#define LC1INTN                          BANKMASK(CLC1CON), 3, b
#define LC1INTP                          BANKMASK(CLC1CON), 4, b
#define LC1MODE0                         BANKMASK(CLC1CON), 0, b
#define LC1MODE1                         BANKMASK(CLC1CON), 1, b
#define LC1MODE2                         BANKMASK(CLC1CON), 2, b
#define LC1OUT                           BANKMASK(CLC1CON), 5, b
#define LC1POL                           BANKMASK(CLC1POL), 7, b
#define LC2D1S0                          BANKMASK(CLC2SEL0), 0, b
#define LC2D1S1                          BANKMASK(CLC2SEL0), 1, b
#define LC2D1S2                          BANKMASK(CLC2SEL0), 2, b
#define LC2D1S3                          BANKMASK(CLC2SEL0), 3, b
#define LC2D1S4                          BANKMASK(CLC2SEL0), 4, b
#define LC2D1S5                          BANKMASK(CLC2SEL0), 5, b
#define LC2D1S6                          BANKMASK(CLC2SEL0), 6, b
#define LC2D1S7                          BANKMASK(CLC2SEL0), 7, b
#define LC2D2S0                          BANKMASK(CLC2SEL1), 0, b
#define LC2D2S1                          BANKMASK(CLC2SEL1), 1, b
#define LC2D2S2                          BANKMASK(CLC2SEL1), 2, b
#define LC2D2S3                          BANKMASK(CLC2SEL1), 3, b
#define LC2D2S4                          BANKMASK(CLC2SEL1), 4, b
#define LC2D2S5                          BANKMASK(CLC2SEL1), 5, b
#define LC2D2S6                          BANKMASK(CLC2SEL1), 6, b
#define LC2D2S7                          BANKMASK(CLC2SEL1), 7, b
#define LC2D3S0                          BANKMASK(CLC2SEL2), 0, b
#define LC2D3S1                          BANKMASK(CLC2SEL2), 1, b
#define LC2D3S2                          BANKMASK(CLC2SEL2), 2, b
