GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.inc
#define SHFT4                            BANKMASK(CRCSHIFTL), 4, a
#define SHFT5                            BANKMASK(CRCSHIFTL), 5, a
#define SHFT6                            BANKMASK(CRCSHIFTL), 6, a
#define SHFT7                            BANKMASK(CRCSHIFTL), 7, a
#define SHFT8                            BANKMASK(CRCSHIFTH), 0, a
#define SHFT9                            BANKMASK(CRCSHIFTH), 1, a
#define SHIFTM                           BANKMASK(CRCCON0), 1, a
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SLRD0                            BANKMASK(SLRCOND), 0, b
#define SLRD1                            BANKMASK(SLRCOND), 1, b
#define SLRD2                            BANKMASK(SLRCOND), 2, b
#define SLRD3                            BANKMASK(SLRCOND), 3, b
#define SLRD4                            BANKMASK(SLRCOND), 4, b
#define SLRD5                            BANKMASK(SLRCOND), 5, b
#define SLRD6                            BANKMASK(SLRCOND), 6, b
#define SLRD7                            BANKMASK(SLRCOND), 7, b
#define SLRE0                            BANKMASK(SLRCONE), 0, b
#define SLRE1                            BANKMASK(SLRCONE), 1, b
#define SLRE2                            BANKMASK(SLRCONE), 2, b
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SMP2                             BANKMASK(SSP2STAT), 7, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SRCS0                            BANKMASK(MDSRC), 0, b
#define SRCS1                            BANKMASK(MDSRC), 1, b
#define SRCS2                            BANKMASK(MDSRC), 2, b
#define SRCS3                            BANKMASK(MDSRC), 3, b
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0, b
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1, b
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2, b
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3, b
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4, b
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0, b
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1, b
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2, b
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3, b
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4, b
#define SSP1IE                           BANKMASK(PIE3), 0, b
#define SSP1IF                           BANKMASK(PIR3), 0, b
#define SSP1IP                           BANKMASK(IPR3), 0, b
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0, b
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1, b
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2, b
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3, b
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4, b
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0, b
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1, b
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2, b
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3, b
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4, b
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0, b
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1, b
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2, b
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3, b
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4, b
#define SSP2IE                           BANKMASK(PIE3), 2, b
#define SSP2IF                           BANKMASK(PIR3), 2, b
#define SSP2IP                           BANKMASK(IPR3), 2, b
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0, b
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1, b
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2, b
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3, b
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4, b
#define SSPCLKPPS0                       BANKMASK(SSP1CLKPPS), 0, b
#define SSPCLKPPS1                       BANKMASK(SSP1CLKPPS), 1, b
#define SSPCLKPPS2                       BANKMASK(SSP1CLKPPS), 2, b
#define SSPCLKPPS3                       BANKMASK(SSP1CLKPPS), 3, b
#define SSPCLKPPS4                       BANKMASK(SSP1CLKPPS), 4, b
#define SSPDATPPS0                       BANKMASK(SSP1DATPPS), 0, b
#define SSPDATPPS1                       BANKMASK(SSP1DATPPS), 1, b
#define SSPDATPPS2                       BANKMASK(SSP1DATPPS), 2, b
#define SSPDATPPS3                       BANKMASK(SSP1DATPPS), 3, b
#define SSPDATPPS4                       BANKMASK(SSP1DATPPS), 4, b
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, b
#define SSPIE                            BANKMASK(PIE3), 0, b
#define SSPIF                            BANKMASK(PIR3), 0, b
#define SSPIP                            BANKMASK(IPR3), 0, b
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM02                           BANKMASK(SSP2CON1), 0, b
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM12                           BANKMASK(SSP2CON1), 1, b
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM22                           BANKMASK(SSP2CON1), 2, b
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
#define SSPM32                           BANKMASK(SSP2CON1), 3, b
#define SSPOV1                           BANKMASK(SSP1CON1), 6, a
#define SSPOV2                           BANKMASK(SSP2CON1), 6, b
#define SSPSSPPS0                        BANKMASK(SSP1SSPPS), 0, b
#define SSPSSPPS1                        BANKMASK(SSP1SSPPS), 1, b
#define SSPSSPPS2                        BANKMASK(SSP1SSPPS), 2, b
#define SSPSSPPS3                        BANKMASK(SSP1SSPPS), 3, b
#define SSPSSPPS4                        BANKMASK(SSP1SSPPS), 4, b
#define START1                           BANKMASK(SSP1STAT), 3, a
#define START2                           BANKMASK(SSP2STAT), 3, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKPTR5                          BANKMASK(STKPTR), 5, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STOP1                            BANKMASK(SSP1STAT), 4, a
#define STOP2                            BANKMASK(SSP2STAT), 4, b
#define STRA                             BANKMASK(CWG1STR), 0, b
#define STRB                             BANKMASK(CWG1STR), 1, b
#define STRC                             BANKMASK(CWG1STR), 2, b
#define STRD                             BANKMASK(CWG1STR), 3, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, a
#define T0ASYNC                          BANKMASK(T0CON1), 4, a
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0, b
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1, b
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2, b
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3, b
#define T0CKPS0                          BANKMASK(T0CON1), 0, a
#define T0CKPS1                          BANKMASK(T0CON1), 1, a
#define T0CKPS2                          BANKMASK(T0CON1), 2, a
#define T0CKPS3                          BANKMASK(T0CON1), 3, a
#define T0CS0                            BANKMASK(T0CON1), 5, a
#define T0CS1                            BANKMASK(T0CON1), 6, a
#define T0CS2                            BANKMASK(T0CON1), 7, a
#define T0EN                             BANKMASK(T0CON0), 7, a
#define T0OUT                            BANKMASK(T0CON0), 5, a
#define T0OUTPS0                         BANKMASK(T0CON0), 0, a
#define T0OUTPS1                         BANKMASK(T0CON0), 1, a
#define T0OUTPS2                         BANKMASK(T0CON0), 2, a
#define T0OUTPS3                         BANKMASK(T0CON0), 3, a
#define T0PR0                            BANKMASK(TMR0H), 0, a
#define T0PR1                            BANKMASK(TMR0H), 1, a
#define T0PR2                            BANKMASK(TMR0H), 2, a
#define T0PR3                            BANKMASK(TMR0H), 3, a
#define T0PR4                            BANKMASK(TMR0H), 4, a
#define T0PR5                            BANKMASK(TMR0H), 5, a
#define T0PR6                            BANKMASK(TMR0H), 6, a
#define T0PR7                            BANKMASK(TMR0H), 7, a
#define T0PS0                            BANKMASK(T0CON1), 0, a
#define T0PS1                            BANKMASK(T0CON1), 1, a
#define T0PS2                            BANKMASK(T0CON1), 2, a
#define T0PS3                            BANKMASK(T0CON1), 3, a
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0, b
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1, b
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2, b
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3, b
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4, b
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1CS0                            BANKMASK(T1CLK), 0, a
#define T1CS1                            BANKMASK(T1CLK), 1, a
#define T1CS2                            BANKMASK(T1CLK), 2, a
#define T1CS3                            BANKMASK(T1CLK), 3, a
#define T1GE                             BANKMASK(T1GCON), 7, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GGO_NOT_DONE                   BANKMASK(T1GCON), 3, a
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GPPS0                          BANKMASK(T1GPPS), 0, b
#define T1GPPS1                          BANKMASK(T1GPPS), 1, b
#define T1GPPS2                          BANKMASK(T1GPPS), 2, b
#define T1GPPS3                          BANKMASK(T1GPPS), 3, b
#define T1GPPS4                          BANKMASK(T1GPPS), 4, b
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GATE), 0, a
#define T1GSS1                           BANKMASK(T1GATE), 1, a
#define T1GSS2                           BANKMASK(T1GATE), 2, a
#define T1GSS3                           BANKMASK(T1GATE), 3, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1RD16                           BANKMASK(T1CON), 1, a
#define T2CKPOL                          BANKMASK(T2HLT), 6, a
#define T2CKPS0                          BANKMASK(T2CON), 4, a
#define T2CKPS1                          BANKMASK(T2CON), 5, a
#define T2CKPS2                          BANKMASK(T2CON), 6, a
#define T2CKSYNC                         BANKMASK(T2HLT), 5, a
#define T2CS0                            BANKMASK(T2CLKCON), 0, a
#define T2CS1                            BANKMASK(T2CLKCON), 1, a
#define T2CS2                            BANKMASK(T2CLKCON), 2, a
#define T2CS3                            BANKMASK(T2CLKCON), 3, a
#define T2INPPS0                         BANKMASK(T2INPPS), 0, b
#define T2INPPS1                         BANKMASK(T2INPPS), 1, b
#define T2INPPS2                         BANKMASK(T2INPPS), 2, b
#define T2INPPS3                         BANKMASK(T2INPPS), 3, b
#define T2INPPS4                         BANKMASK(T2INPPS), 4, b
#define T2MODE0                          BANKMASK(T2HLT), 0, a
#define T2MODE1                          BANKMASK(T2HLT), 1, a
#define T2MODE2                          BANKMASK(T2HLT), 2, a
#define T2MODE3                          BANKMASK(T2HLT), 3, a
#define T2MODE4                          BANKMASK(T2HLT), 4, a
#define T2ON                             BANKMASK(T2CON), 7, a
#define T2OUTPS0                         BANKMASK(T2CON), 0, a
#define T2OUTPS1                         BANKMASK(T2CON), 1, a
#define T2OUTPS2                         BANKMASK(T2CON), 2, a
#define T2OUTPS3                         BANKMASK(T2CON), 3, a
#define T2PSYNC                          BANKMASK(T2HLT), 7, a
#define T2RSEL0                          BANKMASK(T2RST), 0, a
#define T2RSEL1                          BANKMASK(T2RST), 1, a
#define T2RSEL2                          BANKMASK(T2RST), 2, a
#define T2RSEL3                          BANKMASK(T2RST), 3, a
#define T2RSEL4                          BANKMASK(T2RST), 4, a
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0, b
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1, b
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2, b
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3, b
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4, b
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CS0                            BANKMASK(T3CLK), 0, a
#define T3CS1                            BANKMASK(T3CLK), 1, a
#define T3CS2                            BANKMASK(T3CLK), 2, a
#define T3CS3                            BANKMASK(T3CLK), 3, a
#define T3GE                             BANKMASK(T3GCON), 7, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GGO_NOT_DONE                   BANKMASK(T3GCON), 3, a
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GPPS0                          BANKMASK(T3GPPS), 0, b
#define T3GPPS1                          BANKMASK(T3GPPS), 1, b
#define T3GPPS2                          BANKMASK(T3GPPS), 2, b
#define T3GPPS3                          BANKMASK(T3GPPS), 3, b
#define T3GPPS4                          BANKMASK(T3GPPS), 4, b
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GATE), 0, a
#define T3GSS1                           BANKMASK(T3GATE), 1, a
#define T3GSS2                           BANKMASK(T3GATE), 2, a
#define T3GSS3                           BANKMASK(T3GATE), 3, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3RD16                           BANKMASK(T3CON), 1, a
#define T4CKPOL                          BANKMASK(T4HLT), 6, a
#define T4CKPS0                          BANKMASK(T4CON), 4, a
#define T4CKPS1                          BANKMASK(T4CON), 5, a
#define T4CKPS2                          BANKMASK(T4CON), 6, a
#define T4CKSYNC                         BANKMASK(T4HLT), 5, a
#define T4CS0                            BANKMASK(T4CLKCON), 0, a
#define T4CS1                            BANKMASK(T4CLKCON), 1, a
#define T4CS2                            BANKMASK(T4CLKCON), 2, a
#define T4CS3                            BANKMASK(T4CLKCON), 3, a
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
#define T4INPPS1                         BANKMASK(T4INPPS), 1, b
#define T4INPPS2                         BANKMASK(T4INPPS), 2, b
#define T4INPPS3                         BANKMASK(T4INPPS), 3, b
#define T4INPPS4                         BANKMASK(T4INPPS), 4, b
#define T4MODE0                          BANKMASK(T4HLT), 0, a
#define T4MODE1                          BANKMASK(T4HLT), 1, a
#define T4MODE2                          BANKMASK(T4HLT), 2, a
#define T4MODE3                          BANKMASK(T4HLT), 3, a
#define T4MODE4                          BANKMASK(T4HLT), 4, a
#define T4ON                             BANKMASK(T4CON), 7, a
#define T4OUTPS0                         BANKMASK(T4CON), 0, a
#define T4OUTPS1                         BANKMASK(T4CON), 1, a
#define T4OUTPS2                         BANKMASK(T4CON), 2, a
#define T4OUTPS3                         BANKMASK(T4CON), 3, a
#define T4PSYNC                          BANKMASK(T4HLT), 7, a
#define T4RSEL0                          BANKMASK(T4RST), 0, a
#define T4RSEL1                          BANKMASK(T4RST), 1, a
#define T4RSEL2                          BANKMASK(T4RST), 2, a
#define T4RSEL3                          BANKMASK(T4RST), 3, a
#define T4RSEL4                          BANKMASK(T4RST), 4, a
#define T5CKIPPS0                        BANKMASK(T5CKIPPS), 0, b
#define T5CKIPPS1                        BANKMASK(T5CKIPPS), 1, b
#define T5CKIPPS2                        BANKMASK(T5CKIPPS), 2, b
#define T5CKIPPS3                        BANKMASK(T5CKIPPS), 3, b
#define T5CKIPPS4                        BANKMASK(T5CKIPPS), 4, b
#define T5CKPS0                          BANKMASK(T5CON), 4, a
#define T5CKPS1                          BANKMASK(T5CON), 5, a
#define T5CS0                            BANKMASK(T5CLK), 0, a
#define T5CS1                            BANKMASK(T5CLK), 1, a
#define T5CS2                            BANKMASK(T5CLK), 2, a
#define T5CS3                            BANKMASK(T5CLK), 3, a
#define T5GE                             BANKMASK(T5GCON), 7, a
#define T5GGO                            BANKMASK(T5GCON), 3, a
#define T5GGO_NOT_DONE                   BANKMASK(T5GCON), 3, a
#define T5GGO_nDONE                      BANKMASK(T5GCON), 3, a
#define T5GPOL                           BANKMASK(T5GCON), 6, a
#define T5GPPS0                          BANKMASK(T5GPPS), 0, b
#define T5GPPS1                          BANKMASK(T5GPPS), 1, b
#define T5GPPS2                          BANKMASK(T5GPPS), 2, b
#define T5GPPS3                          BANKMASK(T5GPPS), 3, b
#define T5GPPS4                          BANKMASK(T5GPPS), 4, b
#define T5GSPM                           BANKMASK(T5GCON), 4, a
#define T5GSS0                           BANKMASK(T5GATE), 0, a
#define T5GSS1                           BANKMASK(T5GATE), 1, a
#define T5GSS2                           BANKMASK(T5GATE), 2, a
#define T5GSS3                           BANKMASK(T5GATE), 3, a
#define T5GTM                            BANKMASK(T5GCON), 5, a
#define T5GVAL                           BANKMASK(T5GCON), 2, a
#define T5RD16                           BANKMASK(T5CON), 1, a
#define T6CKPOL                          BANKMASK(T6HLT), 6, a
#define T6CKPS0                          BANKMASK(T6CON), 4, a
#define T6CKPS1                          BANKMASK(T6CON), 5, a
#define T6CKPS2                          BANKMASK(T6CON), 6, a
#define T6CKSYNC                         BANKMASK(T6HLT), 5, a
#define T6CS0                            BANKMASK(T6CLKCON), 0, a
#define T6CS1                            BANKMASK(T6CLKCON), 1, a
#define T6CS2                            BANKMASK(T6CLKCON), 2, a
#define T6CS3                            BANKMASK(T6CLKCON), 3, a
#define T6INPPS0                         BANKMASK(T6INPPS), 0, b
#define T6INPPS1                         BANKMASK(T6INPPS), 1, b
#define T6INPPS2                         BANKMASK(T6INPPS), 2, b
#define T6INPPS3                         BANKMASK(T6INPPS), 3, b
#define T6INPPS4                         BANKMASK(T6INPPS), 4, b
#define T6MODE0                          BANKMASK(T6HLT), 0, a
#define T6MODE1                          BANKMASK(T6HLT), 1, a
#define T6MODE2                          BANKMASK(T6HLT), 2, a
#define T6MODE3                          BANKMASK(T6HLT), 3, a
#define T6MODE4                          BANKMASK(T6HLT), 4, a
#define T6ON                             BANKMASK(T6CON), 7, a
#define T6OUTPS0                         BANKMASK(T6CON), 0, a
#define T6OUTPS1                         BANKMASK(T6CON), 1, a
#define T6OUTPS2                         BANKMASK(T6CON), 2, a
#define T6OUTPS3                         BANKMASK(T6CON), 3, a
#define T6PSYNC                          BANKMASK(T6HLT), 7, a
#define T6RSEL0                          BANKMASK(T6RST), 0, a
#define T6RSEL1                          BANKMASK(T6RST), 1, a
#define T6RSEL2                          BANKMASK(T6RST), 2, a
#define T6RSEL3                          BANKMASK(T6RST), 3, a
#define T6RSEL4                          BANKMASK(T6RST), 4, a
#define TMR0H0                           BANKMASK(TMR0H), 0, a
#define TMR0H1                           BANKMASK(TMR0H), 1, a
#define TMR0H2                           BANKMASK(TMR0H), 2, a
#define TMR0H3                           BANKMASK(TMR0H), 3, a
#define TMR0H4                           BANKMASK(TMR0H), 4, a
#define TMR0H5                           BANKMASK(TMR0H), 5, a
#define TMR0H6                           BANKMASK(TMR0H), 6, a
#define TMR0H7                           BANKMASK(TMR0H), 7, a
#define TMR0IE                           BANKMASK(PIE0), 5, b
#define TMR0IF                           BANKMASK(PIR0), 5, b
#define TMR0IP                           BANKMASK(IPR0), 5, b
#define TMR0L0                           BANKMASK(TMR0L), 0, a
#define TMR0L1                           BANKMASK(TMR0L), 1, a
#define TMR0L2                           BANKMASK(TMR0L), 2, a
#define TMR0L3                           BANKMASK(TMR0L), 3, a
#define TMR0L4                           BANKMASK(TMR0L), 4, a
#define TMR0L5                           BANKMASK(TMR0L), 5, a
#define TMR0L6                           BANKMASK(TMR0L), 6, a
